{"meta":{"title":"智能的小王","subtitle":"唯有梦想与好姑娘不可辜负","description":null,"author":"唯一的执著","url":"http://wxyadmin.github.io","root":"/"},"pages":[],"posts":[{"title":"大佬们的博客","slug":"大佬们的博客","date":"2019-12-07T01:25:06.000Z","updated":"2019-12-07T01:58:58.426Z","comments":true,"path":"2019/12/07/大佬们的博客/","link":"","permalink":"http://wxyadmin.github.io/2019/12/07/%E5%A4%A7%E4%BD%AC%E4%BB%AC%E7%9A%84%E5%8D%9A%E5%AE%A2/","excerpt":"","text":"PicGo作者博客地址：https://molunerfinn.com/下载地址：https://github.com/Molunerfinn/PicGo/releasesSakura主题作者博客：https://2heng.xin/","categories":[],"tags":[]},{"title":"每天一点小知识之信息安全工程师 1","slug":"每天一点小知识之信息安全工程师-1","date":"2019-11-28T06:26:14.000Z","updated":"2019-11-28T06:27:44.432Z","comments":true,"path":"2019/11/28/每天一点小知识之信息安全工程师-1/","link":"","permalink":"http://wxyadmin.github.io/2019/11/28/%E6%AF%8F%E5%A4%A9%E4%B8%80%E7%82%B9%E5%B0%8F%E7%9F%A5%E8%AF%86%E4%B9%8B%E4%BF%A1%E6%81%AF%E5%AE%89%E5%85%A8%E5%B7%A5%E7%A8%8B%E5%B8%88-1/","excerpt":"#信息安全基础 考点1、信息安全概念 【考法分析】 本考点主要是对信息安全技术相关概念的考查。","text":"#信息安全基础 考点1、信息安全概念 【考法分析】 本考点主要是对信息安全技术相关概念的考查。 【要点分析】 1．我国居民二代身份证正在使用256位的椭圆曲线新密码；国内外的许多电子商务系统正在使用1024位的RSA密码，与量子计算机类似，DNA计算机也是并行计算的，因此同样对现有密码构成严重的潜在威胁，目前可用于密码破译的量子计算算法主要有Grover算法和Shor算法。 2．在量子计算环境下，RSA，EIGamal，ECC公钥密码和DH密钥协商协议将不再安全；物理世界，人类社会和信息空间（Cyberspace）组成的三元世界。 3．信息空间突出了信息化的特征和核心内涵是信息，网络空间突出了网络互联的特征；网络空间安全的核心内涵仍是信息安全。没有信息安全，就没有网络空间安全。 4．信息安全的属性主要包含： ① 信息的保密性：信息不被未授权者知晓的属性； ② 信息的完整性：信息是正确的，真实的，未被篡改的，完整无缺的属性； ③ 信息的可用性：信息可以随时正常使用的属性。 5．能源，材料，信息是支撑现代社会大厦的三根支柱；信息系统安全可以划分为以下四个层次：设备安全，数据安全，内容安全，行为安全。其中数据安全即是传统的信息安全。 6．信息系统设备的安全是信息系统安全的首要问题；信息系统的设备安全是信息系统安全的物质基础，除了硬件设备外，软件系统也是一种设备。信息系统设备稳定可靠地工作是第一位的安全。 7．数据安全：采取措施确保数据免受未授权的泄露，篡改和毁坏；内容安全：信息安全在政治，法律，道德层次上的要求，还包括信息内容保密，知识产权保护，信息隐藏和隐私保护等诸多方面。行为安全：数据安全本质上是一种静态的安全，行为安全是一种动态安全。行为体现在过程和结果之中。程序的执行学列和相应的硬件动作构成了系统的行为，数据可以影响程序的执行走向。从而可以影响系统的行为。因此，信息系统的行为由硬件，软件和数据共同确定。所以，必须从硬件，软件和数据三方面来确保系统的行为安全。 8．网络空间安全学科是研究信息获取，信息存储，信息传输和信息处理领域中信息安全保障问题的一门新兴学科。 9．2015年6月，国务院学位委员会和教育部正式增设网络空间安全一级学科；网络空间安全学科的主要研究方向有：密码学，网络安全，信息系统安全，信息内容安全和信息对抗。 10．在这些众多的技术措施中，信息系统的硬件系统安全和操作系统安全是信息系统安全的基础，密码和网络安全等技术是关键技术。 11．密码学：由密码编码学和密码分析学组成；网络安全的基本思想是在网络的各个层次和范围内采取防护措施；信息系统安全的特点是从系统整体上考虑信息安全的威胁和防护；信息内容安全是信息安全在政治，法律，道德层次上的要求。也包括信息内容的保密，知识产权保护，信息隐藏，隐私保护等诸多方面。 12．信息对抗的实质是斗争双方利用电磁波和信息的作用来争夺电磁频谱和信息的有效使用和控制权。 13．数学是一切自然科学的理论基础，当然也是网络空间安全学科的理论基础；现代密码可以分为两类：基于数学的密码和基于非数学的密码；设计一个密码就是设计一个数学函数，而破译一个密码就是求解一个数学难题。 14．协议是网络的核心，因此协议安全是网络安全的核心。 15．博弈论便成为网络空间安全学科的理论基础之一；博弈论（Game Theory）是现代数学的一个分支；信息安全领域的斗争，本质上都是人与人之间的攻防斗争，因此博弈论便成为网络空间安全学科的理论基础之一，而且是网络空间安全学科所特有的理论基础。 16．信息论，控制论和系统论是现代科学的理论基础，因此也是网络空间安全学科的理论基础；信息论是商农为解决现代通信问题而创立的，控制论是维纳在解决自动控制技术问题中建立的，系统论是为了解决现代化大科学工程项目的组织管理问题而诞生的；信息论奠定了密码学的基础，信息论也奠定了信息隐藏的基础，因此，信息论构成了信息隐藏的理论基础；信息论的核心思想是整体观念。 17．控制论是研究机器，生命社会中控制和通信的一般规律的科学；控制的基础是信息。 18．保护，检测，响应（RDP）策略是确保信息系统和网络系统安全的基本策略；只有从信息系统的硬件和软件的低层做起，才能比较有效地确保信息系统的安全。 19．网络空间安全学科的许多问题是计算安全问题，因此计算理论也是网络空间安全学科的理论基础，其中包括可计算性理论和计算复杂性理论等；可计算理论是研究计算的一般性质的数学理论。它通过建立计算的数学模型，精确却分那些问题是可计算的，那些问题是不可计算的。 20．计算复杂性理论：研究现实的可计算性，如研究计算一个问题类需要多少时间，多少存储空间。 21．授权是信息系统访问控制的核心，信息系统是安全的，其授权系统必须是安全的；一般操作性的安全问题是1个不可判定问题，而具体的操作系统安全问题却是可判定问题。 22．本质上，密码破译就是求解一个数学难题，如果这个难题是理论不可计算的，则这个密码就是理论上安全的。 23．访问控制理论是网络空间安全学科所特有的理论基础；访问控制是信息系统安全的核心问题；访问控制理论包括各种访问控制模型与授权理论，例如，矩阵模型，BLP模型，BIBA模型，中国墙模型，基于角色的模型（RBAC），属性加密等，其中属性加密是密码技术与访问控制结合的新型访问控制；访问控制理论是网络空间安全学科的理论基础，而且是网络空间安全学科所特有的理论基础。 24．密码学理论是网络空间安全学科所特有的理论基础；数学，信息理论（信息论，系统论，控制论），计算理论（可计算理论，计算复杂性理论）是网络空间安全学科的理论基础，而博弈论，访问控制理论和密码学理论是网络空间安全学科所特有的理论基础。 25．笛卡尔方法分为4步： ① 永不接受任何我自己不清楚的真理。 ② 将要研究的复杂问题，尽量分解为多个比较简单的小问题，一个一个地解决。 ③ 将这些小问题从简单到复杂排序，先从容易解决的问题入手 ④ 将所有问题解决后，再综合起来检验，看是否安全，是否将问题彻底解决了。 笛卡尔的方法论强调了把复杂问题分解成一些细小的问题分别解决，是一种分而治之的思想，是一种行之有效的方法；用整体的思想和方法来处理，由传统的方法论发展到系统性的方法论。 26．网络空间安全学科有自己的方法论，即包含分而治之的传统方法论，又包含综合治理的系统工程方法论，而且将这两者有机地融合为一体；网络空间安全学科具体概括为理论分析，逆向分析，实验验证，技术实现四个核心内容；必须强调指出的是，逆向分析是网络空间安全学科所特有的方法论。 27．网路空间安全学科的每一分支都具有攻和防两个方面： ① 在进行网络安全防护设计时，首先要进行安全威胁分析和风险评估； ② 认识系统的管理者和使用者，因此认识影响信息系统安全的重要因数。 以人为核心，运用定性分析和定量分析相结合，注意量变会引发质变，综合处理，追求整体效能，解决网络空间安全中的理论，技术和应用问题。 【备考点拨】 主要在上午题中涉及，了解并理解相关知识点内容。 考点2、信息安全法律法规 【考法分析】 本考点主要是对信息安全相关法律法规的考查。 【要点分析】 1．我国信息安全的法律体系可分为4个层面： ① 一般性法律规定； ② 规范和惩罚信息网络犯罪的法律； ③ 针对信息安全的特别规定； ④ 具体规范信息安全技术，信息安全管理等方面的法律法规。 2．计算机犯罪的明显特征： ① 隐秘性强； ② 高智能型； ③ 破坏性强； ④ 无传统犯罪现场； ⑤ 侦查和取证困难； ⑥ 公众对计算机犯罪认识不如传统犯罪清晰； ⑦ 计算机犯罪的诱惑性强：技术性强，富于挑战性； ⑧ 计算机犯罪经常是跨国犯罪。 3．计算机犯罪分为以下六类： ① 窃取和破坏计算机资产； ② 未经批准使用计算机信息系统资源； ③ 未批准或超越权限接受计算机服务； ④ 篡改或窃取计算机中保存的信息或文件； ⑤ 计算机信息系统装入欺骗性数据和记录； ⑥ 窃取或诈骗系统中的电子钱财。 4．互联网安全的刑事责任： ① 威胁互联网运行安全的行为； ② 威胁国家安全和社会稳定的行为； ③ 威胁社会主义市场经济秩序和社会管理秩序的行为； ④ 威胁个人，法人和其他组织的人身，财产等合法权利的行为。 5．网络安全问题日益凸显。一是，网络入侵，二是非法获取，三是，宣扬恐怖主义，极端主义，煽动颠覆国家政权，推翻社会主义制度，以及淫秽色情等违法信息。 6．网络运营者应履行下列安全保护义务： ① 制定内部安全管理制度和操作规程，确定网络安全负责人，落实网络安全保护责任； ② 采取防范计算机病毒和网络攻击，网络入侵等危害网络安全行为的技术措施； ③ 采取记录，跟踪网络运行状态，监测，记录网络安全事件的技术措施，并按照规定留存网络日志； ④ 采取数据分类，重要数据备份和加密等措施； ⑤ 法律，行政法规规定的其他义务。 7．对关键信息基础设施，应实行重点保护；网络安全，是指通过采取必要措施，防范对网络的攻击，入侵，干扰，破坏和非法使用以及意外事故，使网络处于稳定可靠运行的状态，以及保障网络存储，传输，处理信息的完整性，保密性可用性的能力。 8．中国计算机信息系统安全保护条例中计算机信息系统的概念，是指由计算机及其相关的和配套的设备，设施和网络构成的，按照一定的应用目标和规则对信息进行采集，加工，存储，传输，检索等处理的人机系统。 9．计算机病毒：是指编制或者在计算机程序中插入的破坏计算机功能或者毁坏数据，影响计算机使用，并能自我复制的一组计算机指令或者程序代码。 10．计算机信息系统安全专用产品：是指用于保护计算机i信息系统安全的专用硬件和软件产品；知识产权包括著作权（也称版权），工业产权（包括专利权和商标权），技术秘密和商业秘密。 11．2002年，国务院《计算机软件保护条例》正式施行。该条例称软件是指计算机程序及其有关文档。同一计算机程序的源程序和目标程序为同一作品。对软件著作权的保护不延及开发软件所用的思想，处理过程，操作方法或者数学概念等。 12．计算机软件受保护的条件有三个：原创性，可感知性，可再现性；计算机软件著作权人享有人身权和财产权。","categories":[],"tags":[{"name":"软考","slug":"软考","permalink":"http://wxyadmin.github.io/tags/%E8%BD%AF%E8%80%83/"}]},{"title":"推荐几个比较实用的网站","slug":"推荐几个比较实用的网站","date":"2019-11-28T04:37:05.000Z","updated":"2019-11-28T04:37:50.620Z","comments":true,"path":"2019/11/28/推荐几个比较实用的网站/","link":"","permalink":"http://wxyadmin.github.io/2019/11/28/%E6%8E%A8%E8%8D%90%E5%87%A0%E4%B8%AA%E6%AF%94%E8%BE%83%E5%AE%9E%E7%94%A8%E7%9A%84%E7%BD%91%E7%AB%99/","excerpt":"大力盘 [https://dalipan.com] 万兴优转 [https://www.media.io/zh/audio-converter.html] 来画视频 [https://www.laihua.com/]","text":"大力盘 [https://dalipan.com] 万兴优转 [https://www.media.io/zh/audio-converter.html] 来画视频 [https://www.laihua.com/] 优品PPT [http://www.ypppt.com/] 比格PPT [http://www.tretars.com] LookAE [http://www.lookae.com/] WolframAlpha [https://wolframalpha.com] 全历史：历史内容聚合网站 [https://www.allhistory.com/] 设计师专属字体下载 +字体识别工具 +字体商用查询 [http://www.hellofont.cn/][http://www.qiuziti.com/][http://fonts.safe.360.cn/] UzerMe云端办公工具[https://www.uzer.me/] SoBooks 强大的电子书资源网站[https://sobooks.cc/] 搞定设计 人工智能在线抠图工具[http://www.aigei.com/] 一键式设计工具+智能抠图[https://www.gaoding.com/] 虫部落 重度网络资源藏家社区[https://www.chongbuluo.com/] 其实好多我都没有用过，请慎用，只做一名好的搬运工","categories":[],"tags":[{"name":"使用教程","slug":"使用教程","permalink":"http://wxyadmin.github.io/tags/%E4%BD%BF%E7%94%A8%E6%95%99%E7%A8%8B/"}]},{"title":"随笔19-11-26","slug":"随笔19-11-26","date":"2019-11-26T10:42:32.000Z","updated":"2019-11-26T10:44:51.782Z","comments":true,"path":"2019/11/26/随笔19-11-26/","link":"","permalink":"http://wxyadmin.github.io/2019/11/26/%E9%9A%8F%E7%AC%9419-11-26/","excerpt":"为了准备信息安全工程师考试，我决定把学习过程的一些知识点记下来，以便日后温故知新。基础知识","text":"为了准备信息安全工程师考试，我决定把学习过程的一些知识点记下来，以便日后温故知新。基础知识 信息安全研究包含：密码学，网络安全，信息系统安全，信息内容安全，信息对抗等。信息安全方法论理论分析 逆向分析 实验验证 技术实现 信息系统安全层次设备安全—稳定性，可靠性，可用性 数据安全—秘密性，完整性，可用性 内容安全—政治健康，合法合规，符合道德规范 行为安全—秘密性，完整性，可控性 信息安全管理密码管理—最有效，最关键的信息安全技术 网络管理—对网络进行有效而安全的监控，检查。ISO定义功能：性能管理，配置管理，故障管理，安全管理，计费管理。 设备管理—选型，安装，调试，安装维护，登记使用，存储管理等 人员管理—对相关人员进行安全意识，法律意识，管理技能等审查与安全教育培训 ISO 安全体系安全机制安全服务ISO参考模型 安全机制保护系统免受攻击，侦听，破坏及恢复系统的机制 安全服务数据处理和数据传输的安全性，利用一种或多种安全机制阻止安全攻击 ISO参考模型开放系统互联参考模型，即七曾协议体系结构。 开放系统互连安全体系结构ISO 参考模型物理层-数据链路层-网络层-传输层-会话层-表示层-应用层 安全机制加密，数字签名，访问控制，数据完整性，鉴别交换，业务流填充，路由控制，公证 安全服务鉴别服务，访问控制，数据完整性，数据保密性，不可抵赖性 网络安全体系结构协议层次—TCP/IP协议 系统单元—安全单元能够解决哪些系统环境安全问题 安全服务—单元能够解决哪些安全威胁 风险评估1、确定资产 2、脆弱性和威胁分析 3、指定对应方案 4、决策 5、沟通交流 6、方案实施 风险评估方法定性风险评估—评估，汇总风险发生的概率和影响，并对风险进行排序 定量风险评估—定量分析已识别风险对项目的整体影响 定性与定量结合—常用层次分析法，核心是将决策这的经验判断进行量化，并提供定量的决策依据。层次分析的基本步骤是系统分解，构造判断矩阵，层次总排序。 风险管理1、规划风险管理—决定如何进行，规划和实施项目风险管理活动 2、识别风险—识别并记录影响项目的风险 3、定性风险风险—评估，汇总风险发生的概率和影响，并对风险排序 4、定量风险分析—定量分析已识别风险对项目的整体影响 5、风险控制—制定对应的消极，积极风险应对方案。包括：避免风险，转移风险，减少威胁，减少脆弱性，减少威胁可能带来的损害，检测意外事件。 6、风险监控—整个项目过程中，跟踪已识别风险，识别新风险，实施风险应对，评估风险有效性。 降低风险的途径 避免风险 转移风险 减少威胁 减少脆弱性 减少威胁带来的损失 检测并响应和恢复意外事件 法规标准计算机犯罪的规定 以计算机资产为犯罪对象的具有严整社会危害性的行为： 1、窃取，破坏计算机资产 2、未经批准使用计算机信息系统资源 3、超越权限的批准或接受计算机服务 4、篡改，窃取计算机中的信息 5、计算机信息系统转入欺骗性数据 6、窃取，诈骗系统中的电子钱财 《中华人民共和国刑法》对计算机犯罪规定 【非法入侵计算机系统罪】 入侵国家事务，国防建设，尖端科学技术领域的计算机系统，三年以下有期徒刑或者拘役 【非法获取计算机信息系统数据，非法控制计算机信息系统罪】违反国家规定，入侵前款规定以外的计算机信息系统或采用其他技术手段，获取计算信息系统中存储，处理，或者传输的数据。三年以下有期徒刑或拘役，特别严重三年以上七年以下，并处罚款。 【提供入侵，非法控制计算机信息系统陈新股，工具罪】提供专门用于入侵，非法控制计算机信息系统的程序，工具，依据前款规定处罚。 【破坏计算机系统罪】违反国家规定，对计算机系统功能进行删除，修改，增加，干扰，造成系统不能正常运行，严重者五年一下有期徒刑或拘役，特别严重的五年以上有期徒刑。 【拒不履行信息网络安全管理义务罪】网络服务提供者不履行法律，行政法规定的信息网络安全管理义务，监管部门责令改之拒不改正，以下情形，三年以下有期徒刑，拘役或管理，并处罚金： 1、导致违法信息大量传播 2、导致用户信息泄露，造成严重后果 3、致使刑事案件证据毁灭，情节严重的 4、有其他严重情节的 【非法利用信息网络罪】利用信息网络，实施下列行为，情节严重的三年以下有期徒刑或拘役，并处罚金： 1、设立用于实施诈骗，传授犯罪方法，制作或销售违禁物品，管制物品，或其他违法犯罪信息 2、发布有关制作或者销售毒品，枪支，淫秽物品等违禁物品，管制物品，或其他违法犯罪信息的 3、为实施诈骗等违法或者发布的消息 【帮助信息网络犯罪活动罪】明知他人利用技术实施犯罪，为其犯罪提供互联网接入，服务器托管，网络存储，通讯传输等技术支持，或者提供广告推广，支付结算，等帮助，情节严重者，三年以下有期徒刑或拘役，并处罚金 刑法追责四类行为 威胁互联网运行安全 威胁国家安全和社会稳定 威胁社会主义市场经济秩序和社会管理秩序 威胁个人，法人，和其他组织的人身，财产等合法权利 《中华人民共和国网络安全法》-禁止为不实名用户提供服务 -出售用户信息最高可处10倍违法所得赔偿罚款 -重大事件可先知网络 -阻止违法信息传播 是本法四大亮点国家实行网络安全等级保护制度第二十一条 国家实行计算机运营者需履行下列保护义务，保障网络免受干扰，破坏者或未经授权的访问，防止网络数据泄露，或被窃取，篡改： 1、制定内部安全管理制度和操作规程，确定网络安全负责人，落实网络安全保护法 2、采取防范计算机病毒和网络攻击，网络入侵，等危害网络安全的技术措施 3、采取监控，记录网络运行状态，网络安全事件的技术措施，并按照规定留存相关的网络日志不少于六个月 4、采取数据分类，钟爱于哦数据备份和加密等措施 5、法律，性质法规规定的其他义务第二十二条网络产品，服务应当符合相关国家标准的强制性要求 第二十三条网络关键设备和网络安全专用产品应当安装相关国家标准强制性要求，由具备资格的机构安全认证合格或者安全检测符合要求后，方可销售或者提供。 第二十四条网络运营者为用户办理网络接入，域名注册服务，班里固定电话，移动电话等入网手续，或者为用户提供信息发布，即时通讯等服务，在与用户签订协议或者确认提供服务时，应要求用户提供真是身份信息。用户不提供真实身份信息的，网络运营者不得为其提供相关服务。 第二十五条 网络运营者应当制定安全事件应急预案，及时处置系统漏洞，计算机病毒，网络攻击，网络入侵等安全风险。 第二十六条开展网络安全认证，检测，风险评估等活动，向社会发布系统漏洞，计算机病毒，网络攻击，网络入侵等网络安全信息，应遵守国家相关规定。 第二十七条 任何个人，组织不得从事非法入侵他人网络，干扰他人网络正常功能，窃取网络数据等危害网络安全的活动。不得提供专门用于入侵，干扰网络正常功能及防护措施，窃取数据等危害网络安全的的程序，工具。明知他人从事危害网络安全活动的，不得为其提供技术支持，广告推广，支付结算等帮助。第三十一条 关键信息基础设施，实行重点保护关键信息基础设施---公共通信，信息服务，能源，交通，水利，金融，公共服务，电子政务等。第三十九条 国家网信部门应当统筹协调有关部门对关键信息基础设施的安全保护采取如下措施：1、对关键信息基础设施的安全风险进行抽查检测，提出改进措施，必要时可以委托网络安全服务机构对网络存着安全风险进行检测评估 2、定期组织关键信息基础设施的运营者进行网络安全应急演习，提高应对网络安全事件的水平和协同配合能力 3、促进有关部门，关键信息基础设施的运营者以及有关研究机构，网络安全服务机构等之间的安全信息共享 4、对网络安全事件的应急处置与网络功能的恢复等，提供技术支持和协助第四十条 网络运营者应当对其收集的用户信息严格保密，并建立用户信息保护机制第四十二条 网络运营者不得泄露，篡改，损毁其收集的个人数据；未经被收集者同意，不得向他人提供个人信息。经过处理，无法识别的个人且不能复原的除外。第四十四条 任何个人和组织不得窃取或者以其他非法方式获取个人信息，不得非法出售或者非法向他人提供个人信息第四十五条 依法负有网络安全监督管理指的部门及工作人员，必须对在履行职责中知悉的个人信息，隐私和商业秘密严格保密，不得泄露，非法出售给他人。第四十七条 网络运营者应当加强对其用户发布的信息的管理，发现法律，行政法规禁止发布或者传输的信息，应当立即停止传输该信息，采取消除等处置措施，防止信息扩散，保存有关记录，并向有关主管部门报告。第四十八条 任何个人和组织发生的电子信息，提供的应用软件，不得设置恶意程序，不得含有关法律，行政法规禁止发布和传播的信息。第四十九条 网络运营者应当尖利网络信息安全投诉，举报制度，公布投诉，举报方式等信息，及时处理有关投诉和举报。第五十条 国家网信部门和有关部门依法履行网络信息安全监督管理职责，发现法律，行政法规机智发布或传输的信息的，应当要求运营者停止传输，采取消除等措施，保存有关记录。第五十一条 国家建立网络安全检测预警和信息通报制度。辅助关键信息基础设施安全保护工作的部门，应当建立健全本行业，本领域的亡灵安全监测预警和信息通报制度，并按照规定报送网络安全监测预警消息第五十五条 发生网络安全事件，应当立即启动网络安全应急愿，对网络安全事件进行调查和评估，要求网络运营者采取技术措施和其他必要措施，消除安全隐患，消除安全隐患，防止扩散，并及时向社会发布与公众有关的警示信息。第五十六条 省级意思人民政府有关部门在履行网络安全监管职责中，发现网络存在较大安全风险，或者发生安全事件的，可以按照规定的权限和程序对网络运营者或者法人代表，有关负责人进行约谈，运营者应采取相关措施，进行整改，消除隐患。因维护国家安全和社会公共秩序，处置重大突发社会安全事件的需要，经国务院批准或决定，可以在特定区域对网络通信采取先知等临时措施。本法定义网络---是指由计算机或者其他信息终端相关设备组成的按照一定规则和程序对信息进行收集，存储，传输，交换，处理的系统。 网络安全---是指通过采取必要措施，防范网络的攻击，入侵，干扰，，破坏和非法使用以及意外事故，使网络处于稳定可靠的运行状态，记忆博鳌镇网络数据的完整性，保密性，可用性的能力。 网络运营者---是指网络的所有者，管理者和网络服务提供者 网络数据---是指通过网络收集，存储，传输，和产生的各种电子数据 个人信息---以电子或者其他形式记录的能干单独或者与其他信息结合识别自然个人身份的各种信息，包括但不限于自然人的姓名，出生日期，身份证号码，个人生物识别信息，住址，电话号码等。《中华人民共和国计算机信息系统安全保护条例》重要条款 第二条 本条例所成的计算机信息系统，是指由计算机及其相关的配套设备，设施构成，安装一定的应用目标和规则对信息进行采集，加工，存储，传输检索等处理的人机系统。 第三条 计算机系统的安全保护，应当保证计算机及其相关配套设备，设施的安全，运行环境的安全，爆炸计算机功能的正常发挥，以及维护计算机系统的安全运行。 第四条 计算机信息系统的安全保护工作，重点维护国家事务，经济建设，国防建设，尖端科学等重要领域的计算机信息系统安全。 第六条 公安部主管全国计算机信息系统的安全保护工作 第九条 计算机信息系统实行安全等级保护。 第十条 计算机机房应当符合国家标准和国家有关规定 第十一条 进行国际联网的计算机信息系统，由计算机系统的使用单位报省级以上人民政府公安机关备案 第十二条 运输，携带，邮寄计算机信心媒体进出境的，应当如实向海关申报 第十三条 计算机信息系统的使用单位应当尖利健全安全管理制度，负责本单位的计算机信息系统的安全保护工作 第十四条 计算机信息系统中发生的案件，有关使用单位应在24小时以内向当地县级以上人民政府机关报告 第十五条 对计算机病毒和危害社会安全的其他有害数据进行防治研究工作，由公安部门归口管理 第十六条 国家对计算机信息信息系统安全专用产品的销售实行安全许可制度。 第十七条 公安机关对计算机信息系统安全的保护工作行使下列监督职权： 1、监督，检查，指导计算机信息系统安全保护工作 2、查处危害计算机信息系统安全的违法犯罪案件 3、履行计算机信息系统安全保护工作的其他监督职责 第十八条 公安机关发现影响计算机信息系统安全隐患时，应当及时通知使用单位采取安全保护措施 第十九条 公安部在紧急情况下，可以就设计计算机信息系统安全的特定事项发布通缉令 第二十条 违反本条例规定，有下列行为之一的，由公安部机关处以警告或者停机整顿： 1、违反计算机信息系统安全保护等级制度，危害计算机信息系统安全 2、违反计算机信息国际联网备案制度的 3、不按照规定的时间报告计算机信息系统中发生的案件的 4、接到公安机关要求改进安全状况通知后，在限期内拒不改进的 5、有危害计算机信息系统安全的其他行为的 第二十八条 本条例下列用语的含义： 计算机病毒---是指编制或者在计算机程序中插入破坏计算机功能或者毁坏数据，影响计算机使用，并能够自我复制的一组计算机指令或者程序代码 计算机信息系统安全专用产品---是指用于保护计算机信息系统安全的专用硬件和软件产品。《信息安全等级保护管理办法》第七条 信息系统的安全保护等级分为一下五级： 第一级 信息系统受到破坏后，会对公民，法人，和其他组织的合法权益造成损失，但不损害国家安全，社会秩序和公共利益 第二级 信息系统受到破坏后，会对公民，法人，和其他组织合法权益产生严重损害，或者对社会秩序和公共利益造成损害，不会损害国家利益 第三级 信息系统受到破坏后，会对社会和公共利益造成严重损害，或者对国家安全造成损害 第四级 信息系统受到破坏后，会对社会秩序和公共利益造成特别严整损害，或者对国家安全造成严重损害 第五级 信息系统受到破坏后，会对国家安全造成特别严重的损害。 第八条 信息系统运营，使用单位依据本办法和相关技术标准对信息系统进行保护，国家有关信息安全监督部门对其信息安全保护等级工作进行监督管理。 第一级 信息系统运营，使用单位应当依据国家有关管理规范和技术标准进行保护。 第二级 信息系统运营，使用单位应当依据国家有关管理规范和技术标准进行保护。国家信息安全监督部门对该级信息系统信息安全保护工作进行指导。 第三级 信息系统运营，使用单位应当依据国家有关管理规范和技术标准进行保护。国家信息安全监督部门对该级信息系统信息安全保护工作进行监督，检查。 第四级 信息系统运营，使用单位应依据国家有关管理规范，技术标准，和业务专门需求进行保护。国家信息安全监督部门对该级信息系统信息安全保护工作进行监督，检查。 第五级 信息系统运营，使用单位应依据国家有关管理规范，技术标准，和业务专门需求进行保护。国家指定专门部门对该级信息系统信息安全保护工作进行专门监督，检查。 第十四条 第三级信息系统应对每年至少进行一次等级测评，第四级信息系统应每半年进行一次等级测评第五级信息系统应对依据特殊安全安全需求进行等级测评。 第十五 二级以上信息系统，应在安全保护等级确定后30日内，到单位所属市级以上公安机关班里备案手续。 第十六条 三级以上信息系统班里手续应同时提供以下材料： 1、系统拓扑结构及说明 2、系统安全组织机构和管理制度 3、系统安全保护设施设计实施方案或者改建实施方案 4、系统使用的信息安全产品清单及其认证，销售许可证明 5、测评后符合系统安全保护等级的技术检测评估报告 6、信息系统安全保护等级专家评审意见 7、主管部门审核批准信息信息系统安全保护等级的意见 第二十二条 三级以上信息系统应对选择符合下列条件的等级保护测评机构进行测评： 1、在中华人民共和国境内注册成立（港澳台地区除外） 2、由中国公民投资，中国法人投资，或者国家投资的企事业单位（港澳台地区除外） 3、从事相关检测评估工作两年以上，无违法记录 4、工作人员仅限中国公民 5、法人及主要业务，技术人员无犯罪记录 6、使用的技术设备，设施应当符合本办法对信息安全产品的要求 7、具有完备的保密管理，项目管理，质量管理，人员管理和培训教育等安全管理制度 8、对国家安全，社会秩序，公共利益不构成威胁 第二十五条 信息系统的密级，由低到高分为秘密，机密，绝密三个等级。依据BMB17-2006《涉及国家秘密的计算机信息系统分级保护技术要求》确定等级。 第二十七条 秘密，机密，绝密等级保护水平不低于国家信息安全等级保护第三、四、五级的水平。《计算机信息系统安全保护等级划分准则》（GB17859-1999）第一级 用户自主保护级 第二级 系统审计保护级 第三级 安全标记保护级 第四级 结构化保护级 第五级 访问验证保护级信息安全标准体系常见代号： 1、国家标准代号：强制性标准代号GB，推荐性标准代号GB/T，指导性标准代号GB/T，实物标准代号GSB 2、行业标准代号：汉语拼音大写字母组成（如电力DL） 3、地方标准代号：由DB枷锁省级行政区划分代码前两位 4、企业标准代号：由Q加上企业代号组成 5、美国国家标准学会（ANSI） 6、国家标准化指导性技术文件：由指导性技术文件代号GB/Z，编号由技术文件的代号，顺序号，年号组成国际标准化组织SC27---信息安全通用方法及技术标准化工作的技术委员会 IEC---国际电工委员会 SG17---ITU（国际电信联盟）下的第17研究组，研究通信系统安全标准 IETF---Internet工程任务组 IEEE---美国电气电工工程师协会 ECMA---欧洲计算机厂商协会 ANSI---美国国家标准化协会 NIST---美国国家标准技术研究所 DOD---美国国防部全国信息安全标准化技术委员会组织结构WG1---信息安全标准体系与协调工作组 WG2---涉密信息系统安全保密标准工作组 WG3---密码技术工作组 WG4---鉴别与授权工作组 WG5---信息安全评估工作组 WG6---通信安全标准工作组 WG7---信息安全管理工作组 大数据安全标准特别工作组信息安全标准可分为信息安全管理系统、技术与工程类标准 信息安全管理体系： 1、BS7799-1 《信息安全管理实施规则》，提供一套信息安全最佳管理组成的实施规则，可作为企业信息安全管理体系建设参考 2、BS7799-2 《信息安全管理体系规则》规定了信息安全管理系统各方面的达标指标 技术与工程标准 《可信计算机系统评估准则》（TCSEC）,俗称“橘皮书”，向制造商提供一直制造标准，同时为用户提供一种验证标准。 《信息技术安全评估准则》（CC），我国依据CC制定了GB/T18336《信息技术安全性评估准则》 CC适用于硬件，固件，和软件实现的信息技术安全措施，包含三个部分： 1、简介和一般模型 2、安全功能要求 3、安全保证要求 信息系统安全工程能力成熟模型（SSE-CMM），确定一个评价安全工程实施的综合框架，提供了度量与改善安全工程的方法。我国安全评测中心评审机构信息安全服务资质的依据就是SSE-CMM密码学基本概念完整性—信息仅能被合法用户访问，不能泄漏给非法用户，实体或过程 保密性—自由只有在授权方或者以授权方式进行修改，所有资源没有授权则不能修改。保证数据完整性，就是保证数据不能被偶然或者蓄意编辑，或者攻击 可用性—资源只有在适当的时候被授权访问，并按需求使用。 密码学 密码学基本概念-密码体制、古典密码及破译方法、量子密码 分组密码-分组密码概念、DES算法、AES算法，SM4算法、分组密码工作模式 序列密码-线性反馈移位寄存器、RC4、ZUC Hash函数-Hash函数的安全性、MD5算法、SHA算法、SM3算法、HMAC算法 公钥密码体制-Diffe-Hellman与ElGamal体制、椭圆曲线密码 数字签名-数字签名 认证-身份认证、报文认证 密钥管理-对称密钥分配、非对称密钥分配 密码体制通用秘密体系： 1、明文空间M-全体明文集合 2、密文空间C-全体密文集合 3、加密算法E-一组明文M到密文C的加密变换 4、解密算法D-一组密文C到明文M的加密变换 5、密钥空间K-包含加密密钥和解密密钥的全体密钥集合密码攻击方法 穷举攻击-对截获到的密文尝试遍历所有可能的密钥，直到获取正确的明文；或者使用固定的密钥对所有的可能的明文加密，直到与截获到的密文一致 统计分析攻击-利用已经获取到的明文与明文已知统计规律进行破译的方法 数学分析攻击-密码分析者针对加解密算法的数学基础和密码学特征，通过数学求解的方法来破译密码。 攻击密码类型 仅知密文-通过截获的密文破解密码 已知明文-已知明文与密文对，来破解密码 选择明文-不仅可以得到一些明文与密文对，还能选择被加密的明文，并获取相应的密文 选择密文-选择一些密文，并得到相应的明文 古典密码置换密码-明文字母不变，但位置被打乱 代替密码-建立一个替换表，加密时通过查表将明文每个字母替换为相应字符，生成密文。 加法密码-加法密码的映射函数为：f(ai)=bi=aj,j=i+k mod n, k为正整数且 0&lt; k &lt; n。i j 为小字母 乘法密码-需要预先知道消息元素的个数，加密的过程其实就是对明文消息所组成的数组下标进行加密，然后用明文消息中加密后位置所对应的明文字符代替。映射函数为：f(ai)=bi=aj j = i*k mod n k为正整数且 0&lt; k &lt; n。i j 为小字母 仿射密码-加法密码和乘法密码的结合，函数为：f(ai)=bi=aj ,j=(ak1+k0) mod n,其中k1和n是互素的。 古典密码的破译方法 穷举分析 统计分析 量子算法量子的叠加性和相干性原理具有计算能力。实用的量子算法包括Shor算法和Grover算法，两种算法均可对RSA，EIGamal，ECC密码及DH密钥协商进行有效攻击。 分组密码分组密码又称对称密码，使用分组密码加密时，先对明文进行分组，每个分组长度相同，然后对每个组的明文进行加密得到等长的密文。 DES算法DES算法分组为64比特，使用56比特密钥对64比特明文进行16轮加密，得到64比特密文。 密钥64比特，使用56比特加密，另8比特做奇偶校验。 DES 使用对合运算，即f = f-1，1为上标 DES加密异或运算：⊕ 加密过程： 1、子密钥生成，64位子密钥经过子密钥算法产生16个子密钥k1...k16，分别在1-16次加密迭代中使用 2、初始置换IP，64位明文经过置换IP表，被打乱重新排列 3、初始置换结果分为两组，L0（32位） ，R0（32位） 4、第一次迭代加密：使用加密函数f和子密钥k1，对R0进行加密，然后与L0进行模2运算（异或运算），记为L0⊕f（R0，k1），结果成为第二次运算的R1，R0成为第二次迭代的L1 5、第2-16次迭代，分别使用子密钥K2-K16，加密结果与第一次加密迭代相同 子密钥产生： 64位密钥经过置换选择1，循环左移，置换选择2，产生16个长为48位的子密钥k 1-k16。 加密函数： 加密函数f(Ri-1,ki),是DES算法的核心算法，函数包含选择运算E，异或运算，代替函数组S（S盒变换），置换运算P。 1），选择运算E与异或运算 选择运算E把Ri-1的32位扩展到48位，并与48位Ki子密钥进行异或运算。 2），S盒变换 一种压缩替换，通过S盒将48位输入变成32位输出。共有8个S盒，并行运算。 3），置换运算P 将S盒输出的32位再进行一次置换。DES安全性：1，密钥太短，经不起穷举攻击 2，存着弱密钥和半弱密钥 弱密钥：产生的子密钥与其本身相同。 半弱密钥：产生的子密钥有些相同，但不完全相同。 弱密钥的产生原理：C和D中的数据进行循环移位后，得到的结果仍然是重复的数据。3DES算法3DES算法是DES的扩展，执行了三次DES。 有两种实现方式： 1，第一，三次使用相同的密钥，密钥长度为128（112位有效） 2，三次使用不同的密钥，密钥长度192位（168位有效） 中国人民银行智能卡技术规范支持3DES 前路实在漫长，也不知道出口是否明亮，只能就这样坚持着，不断的遇到问题，解决问题，还好没有解决不了的问题，只是时间问题，抑或是能力问题，能力会提升起来的，时间也会有所回报。 人的一生确实会遇到许多困难，甚至是绝望的时刻，可是就此放弃，真的不甘心，我不想像一粒尘埃一样消散在历史长河里，卑微如此，我不甘心。 所以，我要像一个孤独的侠客，历经重重困难，砍到每个挡在我面前的敌人，冲破他们，撕裂他们，碾碎他们。 AES算法AES—advanced encryption standard Rijndael算法被选为AES算法 AES明文分组长度可以是，128位，192位，256位。 AES数学基础 加法：多项式洗漱按位模加 乘法：两个多项式相乘，然后模m(x) 乘法逆元 乘法的计算机实现（X乘法，xtime()），xtime（）运算可以方便在计算机上实现乘法运算 加密过程1、最初的子密钥加---明文分组与种子密钥按位进行异或运算 2、前9轮加密操作 1、字节代换---查询S盒表。 S盒的设计原理是将字节非线性的变换为另一个字节： 1、求乘法逆 2、仿射变换 2、行移位变换---对矩阵中的每行，规定第一行循环左移0个字节，第二行循环左移1个字节，第三行循环左移2个字节，第四行循环左移3个字节。 3、列混淆变换---把每列都乘以固定的多项式 4、子密钥加---与第一步相同，结果与该轮子密钥异或运算 3、第10轮加密操作---与前9轮相同，唯一缺少混淆变换AES不是对合运算，因此解密与加密算法不同 解密过程1、行位移求逆2、字节代换求逆3、列混淆求逆 SM4算法我国密码管理局公布的无线局域网产品使用的SM4算法 可以抵御差分攻击，线性攻击 第一次官方公布的密码算法 特点： 分组长度和密钥长度都是128位，处理8位和32位数据单位 属于对合运算，加密和解密相同，只是轮使用的密钥顺序相反基本运算1、模2加 2、循环左移 工作模式5种工作模式 1，ECB---电码本模式，每个分组使用相同密钥。 2，CBC---分组链接模式 1，密文链接方式---明文分组与前一密文分组异或，不利于并行计算 2，明密文链接方式---前与密文分组与前一明文分组异或，再与当前明文分组异或 3，OFB---输出反馈模式 4，CFB---密码反馈模式 5，CTR---计数器模式，把分组密码转为序列密码。序列密码又称流密码，原理是明文流与密钥流按顺序逐比特进行异或运算，从而产生密文流，属于对合运算。 序列密码的关键是保持通信双方的精确同步。 RC4算法简单，速度快，实现容易，应用广泛。 具体步骤： 1、密钥调度算法 2、伪随机子密码生成算法ZUC祖冲之算法，我国自主设计的加密和完整性算法，是一个同步流算法。 对称算法这块并没有记的很详细，一来是图太多，我不会画图，二来是工作接触这块比较多，比较熟悉。 Hash函数用于构建数据的指纹，标识数据，将任意长度的数据输出为固定长度的消息，通过摘要算法。 计算函数又叫摘要算法，散列算法，哈希算法。 特性： 1，单向性，不可逆向运算，知道摘要计算结果，不能计算出原数据 2，弱抗碰撞性 3，强抗碰撞性 攻击方法： 1，穷举工具：典型的有“生日攻击”，产生若干明文消息，计算出消息摘要，然后进行对比，找到碰撞。 2，利用散列函数的代数结构：攻击函数的弱性质，有中间相遇攻击，修正分组攻击，差分分析攻击SHA-1算法输入长度小于2的64次方比特任意消息，输出160比特摘要。 SM3算法是国家密码管理局发布的安全密码杂凑算法，采用Merkle-Damgard结构，把1-2的64次方比特消息，经过填充和迭代压缩，生成256长度的摘要。 可用于数字签名，验证，消息认证码，伪随机数生成等。 Hmac 一种基于密钥和散列函数进行消息认证的方法，要求通信双方共享密钥，约定算法。 公钥密码公钥密码，加密和解密才有不同密钥，分别叫做公钥和私钥。 RSA密码基于大素数分解，核心是模幂运算。 RSA算法可以实现数字签名和数据加密。 注： 加密：公钥加密，私钥解密 签名：私钥签名，公钥验签 RSA密钥长度大于1024位被认为是安全的。 这个地方符号比较难写，可以搜集一些例子。 Diffie-Hellman体制简称DH密钥交换体制，目的是完成通信双方对称密钥的交互，在不安全环境下也不会造成密钥泄露。流程： 1、公开（p，g) 2、通信双方A B交换密钥1、Ai把密钥（随机产生2&lt;=x&lt;p-1）发生给Bi：A=gx(mod p) 2、Bi把密钥（随机产生2&lt;=y&lt;p-1）发生给Ai：B=gy(mod p) 3、通信双方得到公共密钥1、A结合产生密钥和受到的B的密钥，经过计算得到公共密钥 2、B同样进行计算，得到相同的密钥。 ELGamal体制对DH的改进，是基于离散对数问题的公开密钥体制。离散对数问题是指：对于比较大的整数，y，p，g，求出一个整数满足y=g2mod p 是非常困难的。 椭圆曲线密码基于费马大定理：当n&gt;2时，xn+yn=zn没有正整数解。 椭圆曲线的计算比RSA复杂的多，密钥比RSA短。 一般认为160位长椭圆曲线密码相当于1024位RSA密码的安全性。 我国二代身份证采用256位椭圆曲线密码 数字签名确保消息接收者是预期目标，并且内容没有被篡改。 包括签名和验签两个方面。 签名： 1、A使用摘要算法，计算消息摘要。 2、A使用私钥对消息摘要进行加密，将加密摘要和原文发送给B 验签： 1、受到原文和加密摘要后，使用相同摘要算法，对原文进行摘要。 2、使用A公钥对加密摘要解密 3、对比两个摘要，如果一致，则没有被篡改。 认证用于证实某件事情是否真实或有效。 身份认证1，口令认证 2，生物特征认证 报文认证保证通信双方严重每个报文的发送方，接收方，内容，时间的真实性和完整性。 密钥管理原则： 全程安全原则 最小权限原则 责任分离原则 密钥分级原则 密钥更新原则 密钥分级分为三级： 初级密钥：用于加解密数据，一次一密，必须受到高级密钥的保护。 二级密钥：保护初级密钥，生存周期较长。 主密钥：用于保护二级密钥和初级密钥，生成周期很长。 对称密钥分配Kerberos协议，密钥分配中心的核心， 1，验证服务器 2，票据授权服务器 非对称密钥分配1，PKI一组规则，过程，人员，设施，软件，硬件的集合。 有五个组成部分：证书申请者，RA注册中心，CA认证中心，证书库，和证书信任方。1，数字证书 采用公钥体制进行加密和解密，每个用于有一个私钥用于解密和签名，还有一个公钥用于加密和验证。 密码学部分到此就算是完了，也不是很详细，我接触比较多，所以没太过多深挖，下一部分是网络安全。 网络安全OSI 国际标准化组织 OSI模型：开放系统互联参考模型 从低到高：物理层，数据链路层，网络层，传输层，会话层，表示层，应用层 1，物理层 物理层位于最底层，为数据链路层实体提供建立，传输，释放所必需的的物理连接，提供透明的比特流传输。 数据单位是比特，即一个二进制位。 定义了网络的机械特性，电气特性，功能特性，和规格特性。 机械特性：接口的外形，大小，引脚线，排列，固定位置。 电气特性：接口电缆上各条线路出现的电压范围。 功能特性：指明某条线路出现的某一电平的电压的意义。 指明各种可能时间出现的顺序。 2，数据链路层 将原始的传输线路变成一条逻辑的传输线路，实现实体间二进制信息块的正确传输，为网络层提供可靠的数据信息。 数据单位是帧，具有控制流量的功能。 链路是相邻两个节点之间的物理线路。 数据链路可以理解为数据的通道，是物理链路加上必要的通信协议组成的逻辑链路。 功能： 链路连接的建立，拆除，分离 帧定界和帧同步 顺序控制 差错检测，恢复 链路标识，流量控制，拥塞控制 局域网中的数据链层可以分为逻辑链路控制（LLC）和介质访问控制（MAC）两个子层 3，网络层 提供路由选择，选择到的目的主机的最优路径并沿该路径传输数据。 路由选择，中继，激活和终止网络连接，链路复用，差错检测和恢复，流量控制，拥塞控制 4，传输层 端到端传输数据，实现数据分段，传输和组装，差错控制，流量控制，拥塞控制 5，会话层 允许不同主机的用户之间建立会话。 会话是指各种服务，包括对话控制，令牌管理，同步功能。 6，表示层 提供一种通用的数据描述格式，以便不同系统之间的及其进行信息转换和相互操作。 主要功能： 数据语法转换 语法表示 数据加密解密 数据押压缩解压 7，应用层 向应用程序提供服务，按向目标应用程序提供的特性分组，成为服务元素。 分为公共服务元素（CASE）和特定服务元素（SASE）。 封装：数据从高层向低层传递中，每层对接受到的原始数据添加报头和报尾。 网络协议：为网络中的数据交换建立一系列规则，标准，约定。 由语法，语义，时序关系组成。 语法：数据与控制信息的结构或形式。 语义：依据需要发出哪种控制信息，依据实际情况完成动作或响应。 时序关系：又称同步，事件实现顺序的详细说明。 PDU：协议数据单元，对等层次之间传递的数据单位。 实体：任何可以接收或者发生信息的硬件或者软件，进程，通常是特定的软件模块。 SDU（服务数据单元）：层与层间交换数据的单元。 TCP/IP参考模型 从上到下，应用层，传输层，网际层，网络接口层。 1，应用层 包含所有高层协议，与OSI会话层，表示层，应用层对应。 2，传输层 允许源主机与目标主机对等体之间对话，定义了端到端传输协议，TCP，UDP。 与OSI传输层对应。 3，网际层 负责为经过逻辑互联网络中的数据进行路由选择。 4，网络接口层 最底层，没有明确规定。 TCP/IP是一个协议族群。网络接口层：ARP,RARP 网际层：ICMP,IGMP,IP 传输层：TCP,UDP 应用层：HTTP,TELNET,FTP,SMTP,POP,DNS,BOOTP,TFTP,SNMP,DHCP 物理层信号：模拟信号，数字信号。 模拟信号：在一段连续的时间间隔内，代表的信息的特征量可以在任意瞬间呈现为任意数值的信号。 数字信号：用若干个明确定义的离散值表示的时间离散信号。 传输介质：同轴电缆，屏蔽双绞线，非屏蔽双绞线，光纤，无线，蓝牙等。 同轴电缆：中心铜线，塑料绝缘体，网状导电层，电线外皮组成。分为基带同轴电缆，宽带同轴电缆。 基带电缆分：细同轴电缆，粗同轴电缆， 双绞线线序标准：568A,568B。 光纤：传输介质由玻璃纤维或者透明塑料制成，外包一层比玻璃折射率低的材料。 传播模式与芯线，包层折射率，芯线直径，工作波长有关。 无线传输技术：传输介质是无线电波。 1，无线局域网标准：IEEE 802.11，定义了无线的媒体访问控制MAC子层和物理层规范。 分为5个子标准：IEEE 802.11a，IEEE 802.11b，IEEE 802.11g，IEEE 802.11n，IEEE 802.11ac 2，无线个人局域网标准：IEEE 802.15,，适用与短程无线通信。 3，宽带无线接入标准：IEEE 802.16。 4，蓝牙：一种无线技术标准，适用于短距离无线数据交换。 5，3G技术：第三代通信技术，将个人语音通信业务和各种分组交换数据综合在一个统一的网络中的技术，主要技术基础是码多分址（CDMA）,三大标准有：TD-SCDMA,WCDMA,CDMA-2000 6，第四代通信技术：技术包括：TD-LTE,FDD-LTE,UMB,LTE,WiMAX等。 网络设备1，交换机 一种信号准分设备，为自身任意两个端口提供独立电信号通路。 2，路由器 在OSI模型的网络层，进行路由处理和包转发。 3，防火墙 用于控制网络之间的通信。 4，VPN 虚拟专用网络。 我堕落了，真的堕落了。国庆前制定的学习计划基本没有实施，一开始只想放松以下，玩玩游戏，看看直播，熬熬夜，可没想到，如此生活，竟让我不能自拔，忽然又一瞬间感觉到一丝无聊，，一丝惶恐，所以我又回来学习了，老实学习，踏实做事，一步一个脚印。 数据链路层主要知识点：点对点协议，常见广播方式 点对点协议PPP提供一种点到点链路上封装网络层协议信息的标准方法 PPPOE可以使以太网的设备通过一个监督的桥接设备连接到远端的接入集中器上。 集中器实现对接入设备的控制和计费 局域网数据链路层结构IEEE 802 分为两子层： 逻辑链路控制（LLC），与硬件无关，实现流量控制 媒体接入控制（MAC），与硬件相关，提供硬件与LLC的接口 MAC数据帧的封装卸载，帧的寻址和识别，帧的接收与发送，链路管理，帧的差错控制。 访问方式：CSMA/CD,令牌环，令牌总线 帧由八个字段组成，用途不同，长度不等。 前导字段：形为1010...1010，长度7个字节 帧起始字段：固定格式10101011，长度一个字节，不计算在有效信息字段之内，作为同步信号使用，由网卡自动产生，并附加到帧上 目的地址，源地址字段：可以是6个字节，最高位0，代表普通地址，最高位1，代表组地址，全1位广播地址 类型字段：标识上一层使用的什么协议，也可以表示长度。有两个字节，1-1500表示长度值，1536-65535，表示类型值。MAC地址也叫硬件地址，链路地址，48比特组成。 前24位是厂商编号，由IEEE分配给厂家。 后24位是序列号，由厂家烧入网卡的EPROM（一种闪存芯片），表示真真的主机地址，用于接受发送数据，也用于识别主机，全球唯一。 LLC提供四种服务： 1，不确认的无连接服务，即数据报服务，用于点对点通信，广播，多播（组播）2，面向连接服务，虚电路服务，适用于传输很长的数据文件3，带确认的无线连接服务，可靠数据服务，只存在于令牌总线中4，高速传送服务，专为城域网所用 CSMAC/CD一种争用型的介质访问控制协议，原理是发生数据前先监听信道是否空闲，若空闲则发送数据，发送时继续监听，若有冲突，立即停止发送，等待一段时间再发送。 在网络负载较小的时候，CSMA/CD协议效率很高，但是负载增大时，发送效率急剧下滑，适合传输非实时数据。 重要概念： 1，多路访问 2，载波监听 3，冲突检测 4，退避算法，截断的二进制指数退避算法 IEEE 802 系列协议1，IEEE 802.1系列 IEEE 802.1d ：生成树协议（STP） IEEE 802.1P：交换机与优先级相关流量处理协议 IEEE 802.1q：虚拟局域网虚拟桥接局域网协议（VLAN） IEEE 802.1s：多生成树协议(MSTP) IEEE 802.1w：快速生成树协议（RSTP） IEEE 802.1X：基于端口的访问控制协议 2，IEEE 802.2系列 IEEE 802.2逻辑链路控制，提供LAN，MAC子层与高层协议间一致接口 3，IEEE 802.3系列 IEEE 802.3ab IEEE 802.3u IEEE 802.3z：定义了帧突发方式，突发限制65535比特 IEEE 802.3ae 4，IEEE 802.4：令牌总线网 5，IEEE 802.5：令牌换线网 6，IEEE 802.6：城域网MAN，定义城域网媒体访问控制子层和物理层规范 7，IEEE 802.7：宽带技术咨询组 8，IEEE 802.8：光纤技术咨询组 9，IEEE 802.9:集成数据与语音服务 10,IEEE 802.10：定义局域网互连安全机制 11,IEEE 802.11：无线局域网标准 12,IEEE 802.12：按需优先定义使用所需优先访问方法的100Mb/s的以太网标准 13,IEEE 802.13：无 14,IEEE 802.14：有线电视标准 15,IEEE 802.15：无线个人局域网（PAN） 16,IEEE 802.16：宽带无线接入标准 传输介质特性一般使用10Base-T，数字代表速率，单位Mb/s，Base表示基带，Broad表示宽带，T表示双绞线，F表示光纤。 网络层IP协议与IP地址 IP数据报头 版本—长度为4，值为二进制 头部长度—长度为4 区分服务—长度为8，制定特殊数据处理方式，优先权和Tos 总长度—长度16，首部加数据之和的长度，数据报最大长度为65535 标识符—长度16，同数据分段后，标识符一致 标记字段—长度3，第一位不使用，第二位1表示不能分片，0表示允许分片，第三位为1表示之后还有分片，为0表示是最后一个分片。 分片偏移字段—长度13位，单位8字节，表示所分片的分组，处于原始数据的相对位置 生存时间—长度8位，设置最多可以经过路由器的数，常为16,32,64,128 协议字段—长度8位，指明上层分组所使用的协议 头部校验—长度16位，根据IP头部计算得到的校验和码 源地址，目标地址字段—长度32位 可选字段—长度可变，1-40字节不等 IPv4地址使用32位的二进制表示，四个字节。 点分十进制表示法 地址分类： 1，A类地址—1.0.0.0-126.255.255.255 10.x.x.x是私有地址—不再互联网使用，只在局域网使用 127.x.x.x是保留地址—用作回环地址，向自己发送流量 2，B类地址—128.0.0.0-191.255.255.255 172.16.0.0-172.31.255.255是私有地址 169.254.x.x是保留地址—如果IP设置自动获取，没有找到相应的DHCP服务，可能得到保留地址中的IP 3，C类地址—192.0.0.0-223.255.255.255 192.168.x.x是私有地址 4，D类地址—224.0.0.0-239.255.255.255 224.0.0.1代表所有主机与路由器 224.0.0.2代表所有组播路由器 224.0.0.5代表OSPF路由器 224.0.0.6代表OSPF指定路由与备用路由 224.0.0.7代表ST路由 224.0.0.8代表ST主机 224.0.0.9代表RIP-2路由 224.0.0.12代表DHCP服务器/中继代理 224.0.0.14代表RSVP封装 224.0.0.18代表虚拟路由器冗余协议 5，E类地址—240.0.0.0-247.255.255.255 特殊IP 有限组播—255.255.255.255—会被发送到相同屋里网络所有主机 直接组播—主机字段全1，如192.1.1.255—会被路由发送到专门的网路主机 网络地址—主机位全0，如192.168.1.0，表示一个子网 换回地址—127.x.x.x向自己发送数据 子网掩码用于区分网络地址，主机地址，广播地址。是区分网络地址和子网大小的重要指标。掩码不是IP，/从左到右连续1的总数表示，描述称为建网比特数 1，主机数=可用主机数+2 2，A类默认掩码是255.0.0.0，B类默认是255.255.0.0，C类默认是255.255.255.0 IP地址::={&lt;网络号&gt;,&lt;子网号&gt;,&lt;主机号&gt;} 为了解决IP损耗过大，路由表项增长剧烈： VLSM（可变长子网掩码）—允许一个组织在同一个网络地址空间中使用多个不同的子网掩码，可理解为把大网分解成为小网 CIDR（无类别域间路由）—路由器通过前缀来描述有多个位是网络位，剩下的则是主机位，提高了IPv4扩展性和效率，可以理解为把小网合并成大网 计算子网步骤： 1，IP转为二进制 2，子网掩码转为二进制 3，IP与子网掩码按位与 4，结果转为十进制 计算广播地址： 1，IP转为二进制 2，子网掩码转为二进制 3，IP地址与子网掩码按位与 4，子网主机地址全设置1（第四部分） 5，结果转为十进制 子网范围： 子网范围=子网地址-广播地址 最大可用主机数： 最大可用主机数=2主机位-2 主机位： 反转子网掩码二进制 这部分题很多，看起来很复杂，其实有一定的技巧性，计算量并不大，主要是对理论知识的运用，需要多加练习。 ICMPTCP/IP协议族的子协议，处于网络层，用于IP主机和路由器之间船体控制消息。 控制消息是指网络不通，主机是否可达，路由器是否可用等消息。 报文： 封装在IP数据报内，不能保证经过传输的ICMP报文不产生错误 格式： 8位类型-8位代码-16位校验和 分类： ICMP差错报告报文，ICMP询问报文 应用： Ping命令—使用回送应当和回送请求报文 Tranceroute命令—使用时间超时报文和目的不可达报文 ARP和RARP地址解析协议（ARP）—32位IP解析成48位以太网地址 反向地址解析协议（RARP）—48位以太网地址解析成32位IP地址 ARP报文封装在以太帧中进行发送 原理： 1，发送ARP请求—广播方式发送ARP请求分组：本身IP地址，MAC地址，需要解析的IP地址 2，ARP响应—与请求解析的IP地址一致的主机响应，单播方式，响应分组：响应方IP地址，MAC地址 3，A主机写高速缓存—写入ARP高速缓存：记录IP地址与MAC地址的对应关系，每个对应关系有一定的生存时间，过期删除 ARP病毒 利用ARP协议漏洞，破坏客户主机建立正确的IP地址与MAC地址对应关系，发送虚假MAC给主机，可以盗取账号，阻塞网络，瘫痪网络 方式： 发送大量的虚假ARP报文，没有感染ARP木木也可能导致网络访问不稳定。 ARP欺骗原理 相同IP的主机，攻击者让原先的主机瘫痪，仿冒原主机响应，请求主机更新本地ARP缓存，MAC发送变化，攻击者可以窃取数据。 解决手段 1，接入交换机端口绑定固定MAC地址 2，查看接入交换机端口是否异常（短时间多个MAC地址） 3，安装ARP防火墙 4，发现ARP缓存中MAC不正确时arp -d清除缓存 5，使用arp -s gate-way-mac 设置静态绑定 IPv6下一代IP协议，长度128位，通常写做8组，每组4个十六进制数 书写规则 1，任何一个16位段中起始的0都不必写出来，如果少于4个十六进制的数字，就认为忽略起始部分的0，末尾不能忽略 2，任何一个由全0组成的一个或多个16位段的单个连续字符串都可以用双冒号“::”表示，::只能使用一次 单播地址 用于表示单台设备地址 与多播地址的区别在于多播地址高8位总是FF 分类： 1，全球单播地址—全球唯一，48位路由选择前缀+16位子网ID+64位接口ID 2，链路本地单播地址—用于启动或尚未获取较大范围地址时，链路节点自动地址配置，起始前10固定是1111111010（FE80::/10） 3，地区本地单播地址—给定区域内的唯一地址，其他区域可以相同，起始前10位固定是1111111011（FE8C::/10） 4，任意播地址—取自单播地址空间，使用好处是路由器总会选择最近的的或代价最小的服务器路由 5，组播地址—由一台设备发送给多台设备，报文包括一个源地址，和多个目标地址 NAT网络地址转换，将数据报文中的IP地址转换位另一个IP地址，一般是私有地址转为共有地址。 静态NAT—内外网IP地址映射关系是固定的 动态NAT—内外网IP地址映射关系是动态的 NAPTNAT的一种变形，允许多个内部地址映射到同一个共有地址。 隐藏内部IP配置，节省外部接入IP地址资源 传输层网络服务分类 1，面向连接服务 2，无线连接服务 TCP传输控制协议（TCP） 一种可靠的面向连接的字节流服务 报文首部格式 源端口和目的端口—长度16位，取值0-65535 序列号—长度32位，取值[0，232-1] 确认号—长度32位，期望收到对方下一个报文第一个数据字段的序号 报头长度—数据偏移长度，长度4位，单位32位， 保留字段—长度6位，通常为0 标记—紧急（URG），确认（ACK），推送（PSH），复位（RST），同步（SYN），终止（FIN） 窗口大小—长度16位，范围[0,216-1],进行流量控制柜，单位字节，期望一次接收的字节数 校验和—长度16位，对TCPO报文头顶校验计算，验证 紧急指针—长度16位，偏移量 选项—长度可变到40字节，为保证报头长度为32的倍数，而进行填充0 TCP建立连接 三次握手建立连接 1，第一次握手—源主机发送一个标志位位SYN=1的TCP数据段，标明初始序号，源主机进入SYN-SENT状态 2，第二次握手—目标主机接收到SYN后发送确认数据和报文，ACK=1，目标主机进入SYN-RCVD状态，源主机进入ESTABLISHED状态 3，第三次握手—源主机回送一个确认数据段，带有递增的发送序号和确认序号。 TCP释放连接 双方均处于ESTABLISHED状态 第一步—源主机发送释放报文，进入GIN-WAIT状态 第二步—目标主机接收到后，发出确认报文，目标主机进入CLOSE-WAIT状态，源主机停止发送报文，连接进入HALF-CLOSE状态，等待目标主机发出FIN报文 第三步—目标主机确认没有数据，向源主机发送后，发出释放报文，，目标主机进入LAST-ACK状态 第四步—源主机接收到确认报文后，，对此发送确认报文，等待一段时间，确定送达后，进入CLOSED状态，目标主机也进入CLOSED状态 重传时间 可靠性的保证机制是超时重传，核心是重传超时时间的计算 参数如下： 往返时间（RTT）—给对端发送一个数据报，接收对端的ACK，计算包往返的时间：RTT=链路层传播时间+端点协议栈的的处理时间+中间设备处理时间 加权平均往返时间（RTTS）—平滑往返时间，是通过多次RTT的样本计算出的结果:新的RTTS=（1-α）x 旧的RTTS+α x 新的RTT样本，推荐阿尔法值为1/8 重传超时时间（RTO）—基于RTT计算出的一个定时器超时时间，每发送一个TCP报文段，就开启一个重传计时器。公式：RTO=RTTS+4xRTTD，RTTD初始值为1/2xRTT样本值，计算RTTD公式：新的RTTD=（1-β）x 旧的RTTD+β x |RTTS-新的RTT样本| TCP拥塞控制 防止过多数据注入网络，避免设备过载机制： 慢开始+拥塞避免—发送方位置一个拥塞窗口的状态变量，大笑取决于网络拥塞程度。一开始就发送较大的数据，让cwnd缓慢增加 快重传快恢复—在接收到失序的报文时，立即发出重复确认，发送方只要收到三个重复确认，就立即重传对方未接受到的报文段。 慢开始只有在TCP建立连接和网络出现超时是才使用 UDP用户数据报协议 一种不可靠的，无连接的数据报服务，比TCP效率更高 头部结构 源端口号—16位 目标端口号—16位 长度—16位 校验和—16位 协议端口号 端口号用于识别主机进程，取值范围0-65535 常用协议端口 FTP-DATA—FTP数据传输—20 FTP—FTP控制—21 SSH—SSH登陆—22 TELNET—远程登陆—23 SMTP—简单邮件传输协议—25 DNS—域名解析—53 DHCP—DHCP服务器开启，用于监听和接收客户请求—67 DHCP—客户端开启，用于接收DHCP服务器的消息—68 TFTP—简单FTP—69 HTTP—超文本传输—80 POP3—邮局协议—110 IMAP—交互式邮件存取协议—143 SNMP—简单网管协议—161 SNMP（Trap）—SNMP Trap报文—162 应用层DNS—域名系统，把主机域名解析为IP地址的系统，由解析器和域名服务器构成。 主要基于UDP协议，少数情况使用TCP协议，端口号53 域名系统： DNS名字空间—明明方法层次树状结构，每个主机都有唯一的层次结构，即为域名，域名结构为：主机…三级域名.顶级域名 域名服务器—按空间层次分为，根域名服务器，顶级域名服务器，权限域名服务器，本地域名服务器；按作用分为主域名服务器，辅域名服务器，缓存域名服务器，转发域名服务器 域名解析 将域名解析为IP地址，方法有递归查询和迭代查询 递归查询—先查询本地，然后查询上一级 迭代查询—先查询本地，失败则直接向根域名服务器发起查询请求 DHCP 动态主机配置协议，基于BOOTP，简化主机IP配置管理 当需要跨域多个网段提供DHCP服务，必须使用DHCP中继代理，即在DHCP客户和服务器之间设立转发消息的主机或路由 服务端DHCP服务使用67端口，客户端DHCP服务使用68端口 windows系统系统DHCP无法找到对应服务器，获取IP时，获取到的IP为169.254.x.x DHCP工作过程 1，客户端发起IP租用请求 2，服务器提供IP租用服务 3，客户端IP租用选择 4，客户端确认IP租用 5，客户端重新登录 6，更新租约 WWW 万维网，巨大的，可以互联的资源空间 通过URL定位，使用HTTP协议传送，用HTML文档展示 三个标准组成：URL,HTTP,HTML URL—统一资源定位符 HTTP—超文本传送协议 HTML—超文本标记语言 HTTP请求报文方法： GET—读取URL标识的信息 HEAD—读取URL标识信息首部 POST—把消息加载到指定的网页 PUT—指明URL创建或修改资源 DELETE—删除URL所指定的资源 OPTION—请求以下参数信息 TRACE—进行换回测试 CONNECT—用于代理服务器 E-mail 电子信箱，提供信息交换的通信方式，可以文字，图像，声音 常用协议： 1，SMTP（简单邮件传输协议）—邮件发送接收，25端口 2，POP（邮局协议）—目前POP3，当邮件被读取，POP服务器就会删除邮件 3，IMAP（internet 邮件访问协议）—目前IMAP4，替代POP3，提供邮件检索和处理，143端口 邮件安全 攻击方法： 利用邮件服务器操作系统漏洞 利用邮件服务器软件本身漏洞 在传输过程中窃听 PGP 一款邮件加密协议，采用RSA算法和船体加密的杂合算法，数字签名的邮件文摘算法，加密前压缩 FTP 文件传输协议，控制文件的双向传输，客户端端口20，服务器端端口21 两种工作方式： 主动式 被动式 TFTP 简单文件传输协议，基于UDP，支持文件传输，但不支持交互，一般用于路由，交换机，防火墙配置文件，IOS备份和替换 OSI网络管理： 性能管理 配置管理 故障管理 安全管理 计费管理 管理系统组成： 管理站—管理代理和信息库 代理—手机被管理设备各种请求 管理信息库—分布式数据库，提供被管理系统及设备信息 网络管理协议—SNMP，CMIS/CMIP SNMP 简单网络管理协议，在应用岑进行设备通信管理的协议，基于UDP 一组标准，由SNMP协议，管理信息库（MIB），管理信息结构组成（SMI） 实体发送请求和应答端口默认161，代理发送陷阱报文默认端口162 Telnet TCP/IP终端仿真协议，一种基于TCP的虚拟终端通信技术，端口23 实现数据传输，远程登陆，远程管理交换机和路由器 SSH 安全外壳协议，创建在应用层和传输层基础上的加密隧道安全协议 特点是加密和认证 三个部分组成： 1，传输层协议—服务器认证，数据机密性，完整性保护，数据压缩，密钥交换 2，用户认证协议—提供会话唯一表示，然后服务器和客户端之间进行认证 3，连接协议—提供交互式登录会话，可以远程执行命令 VoIP 将模拟声音信号数字化，通过数据报在IP数据网络上做实时传输 RIP 路由信息协议 使用距离矢量路由协议 每个路由器都有一个矢量表，列出一直的每个目标的最佳距离及使用路线 基于UDP协议，端口520 RIPv1基于广播 RIPv2基于组播 更新周期30s，180s不回应，标识不可达，240s不回应，删除路由信息 解决矢量路由协议问题措施： 1，水平分割 2，路由中毒 3，反向中毒 4，抑制定时器 5，触发更新 OSPF 开放式最短路径优先 一个内部网关协议 用于单一自治系统 适用消息，中型，较大网络 采用最短路径优先算法 基于IP，协议号89 组播方式发送数据报 AS 自治系统，使用同一个内部路由协议的一组网络，编号1-64511位共有AS，64512-65535为私有AS IGP 内部网关协议，发现和计算自治域内的路由信息，使用协议有RIP,OSFP,IS-IS,EIGRP,IGRP EGP 外部网关协议，连接不同自治系统的相邻路由交换路由信息协议，使用BGP协议 链路状态路由协议 路由器会与相邻的路由器共享路由信息 OSFP报文： 1，HELLO 2，数据库描述信息 3，链路状态请求信息 4，链路状态更新信息 5，链路状态应答消息 BGP 边界网关协议，母亲BGP4，一种增强的距离矢量路由协议，基于TCP，端口179 特点： 1，不用周期性发送路由信息 2，路由变化，发送增量路由 3，周期性发送KEEPLIVE报文校验TCP连通性 BGP消息： 1，OPEN报文 2，KEEPLIVE报文 3，UPDATE报文 4，NOTIFICATION报文 工作流程： 1，BGP路由器直接进行TCP三次握手，建立会话 2，交换OPEN信息 3，交换所有BGP路由，直到平衡 4，路由更新 5，KEEPLIVE验证路由器是否可用 6，出现问题，发送NOTIFICATION消息通知错误 IGMP internet 组管理协议，一个组播协议，运行与主机和组播路由间 网络安全安全攻击类型 中断 窃取 篡改 伪造 APT 高级持续性威胁，利用先进的攻击手段和社会工程学方法，对特定目标进行长期持续性渗透和攻击 分五步： 情报收集 防线突破 通道建立 横向渗透 信息收集级外传 暗网 表层网络：任何搜索引擎都能抓取并轻松访问，只战整个网络4%-20% 深网：表层之外的网络，普通搜索引擎无法抓取这类网站 暗网属于深网的一部分，不能被超链接访问，只能通过动态网页技术访问。 网络监听 监听网络状态，数据流，及网络上传输的信息 口令破解 字典攻击 强行攻击 组合攻击 拒绝服务攻击（DOS） 让目标服务器停止提供服务或者资源访问 主要模式： 消耗资源 篡改配置 物理破坏 利用处理程序错误 服务端口攻击 向主机端口发送大量数据，从而是主机不能提供正常服务 常见攻击： 1，SYN Flooding 2，Smurf攻击 3，利用程序的错误 4，电子邮件轰炸 DDOS分布式拒绝服务攻击 很多DOS攻击源一起发起攻击 特点： 1，被攻击主机有大量等待TCP连接 2，大量的TCP，UDP数据分组不是现有服务连接，指向机器任意端口 3，大量无用数据包，源地址是假冒地址 4，网络出现大流量无用数据，造成网络拥塞 5，利用受害主机的服务和协议缺陷，反复发送请求 LDOS（低速率拒绝服务） 不需要维持高频率攻击，耗尽被攻击者的可用资源 漏洞攻击 利用硬件，软件，策略上的缺陷 缓冲溢出 向缓冲区写入超长的预设内容，导致缓冲溢出，覆盖其他程序或数据，让后就算计转而运行该预设内容，打到执行非法操作的目的 系统漏洞 利用软件或操作系统在逻辑上的缺陷或错误 僵尸网络 采用一种或多种手段使大量主机感染僵尸程序，从而在控制者和被感染者间形成一对多的控制网络 防御手段： 蜜罐技术，网络流量研究，IRCserver识别技术 网站安全威胁 1，SQL注入 2，跨站攻击 3，旁注攻击 4，失效的身份认证和会话管理 社会工程学 利用社会科学并结合常识，有效利用，获取机密信息的学科 使用非计算机手段得到敏感信息的方法集合 恶意代码 没有作用却会带来危险的代码 特点： 1，恶意的目的 2，本身是计算机程序 3，通过执行发生作用 病毒，木马，蠕虫，后门，逻辑炸弹，广告软件，间谍软件，恶意共享软件等 蠕虫 一段可以借助程序自行传播的程序或代码 木马 通过伪装吸引用户下载，并未施种者提供被种主机的门户 正向连接木马—在中马者机器上开一个端口，让攻击者去连接 反向连接木马—让被攻击者主动连接到外部的机器，可以轻松突破防火墙 计算机取证 电子证据 以下情况证据不具有合法性： 通过窃录方式获得电子证据 通过非法搜查，扣押获得 通过非核证程序获取 通过非法软件获得 取证步骤： 1，准备工作 2，保护目标计算机系统 3，确定电子证据 4，收集电子证据 5，保全电子证据 常用工具： X-Ways Forensics—综合取证，分析 X-Ways Trace—追踪分析浏览器上网记录，windows回收站删除记录 X-Ways Capture—获取正在运行的操作系统下硬盘，文件，和RAM数据 FTK—自动文件分类，定位嫌疑文件 FBI—电子邮件关联性分析 Guidance Software—构建独立的硬盘镜像，从屋里层面阻断操作系统向硬盘写入数据 网络蜜罐 一个安全资源，用于探索，攻击和损害，收集入侵数据。 牺牲型蜜罐—一台简单的位特定攻击设计的计算机，为攻击者提供目标，容易被利用攻击其他主机 外观型蜜罐—仿真网络服务，不会导致真的被攻击，可迅速手机入侵者信息 测量型蜜罐—结合以上两者优点，容易访问，但很难绕过 配置方式： 1，诱骗服务 2，弱化系统 3，强化系统 4，用户模式服务 匿名网络 第二代洋葱路由（TOR）的一种实现，专门防范流量过滤，嗅探分析 真的TOR的攻击： 时间攻击 通信流攻击 网络存储 1，DAS（之间附加存储）—设备通过电缆直接连接服务器 2，NAS（网络附属存储）—采用独立服务器，单独位数据存储而开发一种文件存储服务器 3，SAN（存储区域网络）—采用高速光纤通道作为传输介质的网络存储技术 安全设备 防火墙 入侵检测与入侵防护 VPN 网络协议分析攻击 防火墙 用于控制网络之间的通信 常见防火墙技术： 1，包过滤防火墙—针对网络层和传输层，对数据包源地址，目的地址，和协议进行检查 2，代理服务器式防火墙—对第四层到第七层数据进行检查 3，基于状态检测的防火墙—检测每个TCP，UDP会话连接 ACL 访问控制列表，目前使用最多的访问控制实现技术，是路由器接口的指令列表，控制进出的数据包 分类 标准访问控制列表—基于IP地址，取值1-99，分析数据包源地址，决定数据的允许或拒绝 扩展访问控制列表—通用扩展访问控制列表，针对TCP,UDP扩展访问控制，针对ICMP扩展访问控制 — 这里配置各种防火墙需要用到一些命令，后面补充— 防火墙模式： 用户模式—登陆防火墙后 特权模式—用户模式输入enable 全局配置模式—特权模式输入configure terminal 监视模式—重启过程中按住esc 防火墙基本配置： 1，配置防火墙接口—nameif 2，配置接口参数—interface 3，配置接口地址—ip address 4，配置公网地址和定义地址池—global 5，地址转换—nat 6，路由配置—route 7，配置静态地址映射—static 8，侦听—fixup 入侵检测 IDS，从系统运行或处理各种数据中查找出威胁系统安全的因素，并对其做出处理，一般认为是被动防护。 一种安全模型：防护，检测，响应。 分类： 基于主机 基于网络 基于主体 入侵检测步骤： 信息收集 数据分析 入侵防护 IPS，一种识别潜在威胁并迅速做出应对的网络安全防范办法，一般认为是主动防护。 VPN 虚拟专用网络，用于在公用网络上建立专用网络的技术。 一般由三部分组成，客户机，传输介质，服务器 关键技术：隧道技术，加解密技术，密钥管理技术，身份认证技术 主要协议：PPTP—点到点隧道协议，让用户拨号连接到本地ISP，然后通过因特网安全访问内网资源的技术，第二层隧道协议 L2TP—PPTP与L2T的综合，思科公司推出的的一种技术，第二层隧道协议 IPsec—在隧道外再封装，第三层隧道协议 SSL VPN—使用了 SSL 实现VPN，第四层隧道协议 TLS VPN—使用了 TLS 实现VPN，第四层隧道协议 IPsec internet协议安全性，通过对IP协议的分组进行加密和认证来保护IP协议的网络传输协议簇 由建立安全分组流密钥交换协议和保护分组流的协议两部分组成 IKE协议—密钥交换协议，一种混合型协议，由ISAKMP框架，OAKLEY密钥交换模式，以及SKEME共享和密钥更新技术组成 AH—认证头，为IP数据报提供完整性检查与数据源认证，并防止重放攻击，常用MD5，SHA1 ESP—封装安全载荷，可以同时提供数据完整性确认以及数据加密，常用DES,3DES,AES加密，MD5，SHA1校验完整性 IPsec两种工作模式：传输模式，隧道模式 MPLS VPN承载平台由P路由器，PE路由器，CE路由器组成 P路由负责依据MPLS标签完成数据包的高速转发 PE路由负责传递数据包MPLS标签生成和去除，还负责发起根据路由建立交换标签的动作 CE路由器直接与电信运营商连接的用户端路由 RADIUS 远程用户拨号认证系统，目前应用最广，的授权，计费和认证协议 SSL TLS SSL，安全套接字协议，一个安全传输，保证数据完整的安全协议，TLS是SSL的非专有版本 SSL有三个高层协议： SSL握手协议—在客户端与服务端通过握手获得密钥 SSL修改密文协议—每隔一段时间就修改加解密参数 SSL告警协议—为对等尸体传递SSL相关警告 SSL协议工作流程: 1，浏览器向服务器发送请求信息，包含SSL版本，选择对称密钥算法 2，服务器返回浏览器请求，附加生成主密钥所需的信息，包含确定的SSL版本，和对称密码算法，某个CA中心私钥加密后的服务器证书 3，浏览器对照自己的可信CA表判断服务器证书是否在可信的CA表中，如果不在，则终止，如果在，则使用CA表中对应的公钥解密，得到服务器的公钥 4，；浏览器随机产生一个对称密钥，使用服务器公钥加密发送给服务器 5，浏览器与服务器之间相互发送一个报文，确定使用的对称密钥，再发送一个报文，确定握手完成 6，握手完成，双方使用对称密钥对发送的报文加密 HTTPS S-HTTP 超文本传输协议（HTTPS），以安全为目的的HTTP通道，是HTTP的安全版 安全超文本传输协议（S-HTTP），一种面向安全的信息通信协议，提供通信保密，身份识别，可依赖传输服务，以及数字签名 S/MIMIE 用于支持邮件的加密，提供认证，完整性保护，鉴定及数据加密 —第五章完结了— 系统安全安全的基本要素 1，机密性 2，完整性 3，可用性 4，可控性 5，可审查性 海明码距是两个码字中不相同的二进制位的个数 两个码字码距是一个编码系统中任意两个合法编码（码字）之间不同的二进制数位数 编码系统的码距是整个编码系统中任意两个码字的码距的最小值 误码率是传输错误比特所占传输总比特的比率 检测d个错误，编码系统的码距&gt;=d+1，纠正d个错误，编码系统码距&gt;2d 海明码 一种多重奇偶检错系统，具有检错和纠错的功能，传输的全部信息由原来的信息附加奇偶校验位组成的。 设校验位为k，信息位为m，则他们之间的关系满足m+k+1&gt;2k CRC编码 循环冗余校验，广泛用于无线通信中，又称多项式编码。 基本思想是把位串看成一个多项式，一个k位的帧看成k-1次多项式的系数列表。 电子信息系统机房划分为A，B，C三级 操作系统安全机制 1，鉴别 2，最小特权管理 3，运行保护机制 4，存储保护机制 5，可信通路机制 6，文件保护—文件备份，文件恢复，文件加密 7，安全审计 智能卡攻击手段： 1，屋里篡改—使卡中的集成电路暴露出来，直接用微探针读取内存 2，时钟抖动—在某一精确时间突然注入高频脉冲，导致处理器丢失一两个指令 3，超范围电压攻击—调整电压，使处理器出错 信息隐藏 研究如何将机密信息隐藏于公开的载体信息中，然后使用公开的载体传输机密信息。 隐私保护技术 1，基于数据失真的技术 2，基于数据加密的技术 3，基于数据匿名化的技术 信息系统的安全设计 1，开放式系统安设计 2，封闭系统安全设计 安全工程能力评估 SSE-CMM三个域组 1，风险过程域组—评估影响，评估安全风险，评估威胁，评估脆弱性，评估风险 2，工程过程域组—实施安全控制，协调安全，剑士安全态势，提供安全输入，确定安全需求 3，保证过程域组—建立保证论据，校验和确认安全 SSE-CMM五个能力水平 非正式执行级—过程域中的基本实施通常已经得到执行 计划和跟踪级—基本实施的执行要经过规划并跟踪管理 充分定义级—基本实施应该按照充分定义的过程来执行 量化控制级—对过程执行情况的详细测量将在本级中进行收集和分析 持续改进级—基于对过程变化的效果量化理解，既定和标准过程将得到不断改进和提高 windows基础 用户域与组 1，Administrator—是administrators组成员，对服务器有完全的控制权，可以根据需要向用户分配权限。 2，Guest—一般是在这台计算机没有实际账号的人使用，如果禁用，还没删除没人的账号，依然可以使用。 3，IUSER_机器名，IWAM_机器名—安装IIS后自动生成的账号，IUSER通常是文本匿名用户或internet来宾账号，IWAM是应用程序所使用的账号，ASP使用的账号就IWAM_机器名 组账号 1，administrators组—对服务器有完全的控制权，可以为用户指派权利和访问控制权限 2，guests—拥有一个在登陆时创建的临时配置文件，注销时删除 3，power users—可以创建本地组，并在已创建的组中添加或者删除用户， 4，backup operators—可以运行系统的备份工具，对文件夹进行备份和还原 5，users—可以运行应用程序，但是不能改变操作系统的设置 6，network configuration operators—可以执行一般的网络设置任务，不能设置改变网络服务器 7，everyone—任何用户都属于这个组，当guests被启用时，该组的权限必须严格设置 8，interactive—任何本地登陆用户都属于这个组 9，system—用于系统中最高的权限，系统和系统服务都靠system赋予权限，默认情况下，只有administrator和system拥有访问和完全控制终端服务器的权限 网络命令 1，ipconfig—显示计算机网络适配器中的IP地址，子网掩码，默认网关 2，tracer -d 禁止tracert将中间的路由器IP解析为名称 -h 指定搜索目标的路径中存在的节点数最大值 -w 指定等待 IMCP超时的消息时间 -R 指定IPv6路由扩展标头将“消息回显”发送到本地计算机，使用目标作为中间目标并测试反向路由 -S 指定在“回显请求”消息中使用的源地址，仅追踪IPv6时才使用该参数 -4 指定IPv4协议 -6 知道IPv6协议 targetname 指定目标 3，arp -s 静态指定IP地址与MAC地址的对应关系 -a 显示所有IP地址与MAC地址对应关系 -d 删除指定的IP与MAC对应关系 -N if_addr 只显示if_addr这个接口的arp信息 4，route—用于手动配置静态路由并显示路由信息表 5，netstat—监控TCP/IP网络的工具，一般用于检验本机各端口的网络连接情况6，nslookup—用于查询internet域名信息或诊断DNS服务器稳定的工具 Linux基础 分区 至少需要两个专门的分区 1，Linux Swap 分区，不用指定载入点，作为交换分区，至少等于系统实际的内存容量 2，Linux Native 存放系统文件的地方，能用ext2和ext3等分区类型 常见分区格式 1，ext—一种专为linux设计的文件系统类型，扩展文件系统 2，ext2—解决ext缺陷而设计的高性能文件系统，二级扩展文件系统 3，ext3—ext2的升级版，增加了元数据的日志功能 4，iso9660—iso9660标准CDROM文件系统，允许长文件名 5，NFS—允许多个计算机之间共享同一个文件系统 6，HPFS—高性能文件系统，提供更多组织特性，改善文件系统安全性 文件管理 多级目录的树形层次结构管理文件 目录： /—根目录 /boot—操作系统内核和启动系统过程中用到的文件 /home—存放系统中普通用户的宿主目录，每个用户都有一个与用户名相同的目录 /tmp—系统临时目录 /usr—存放大量的系统应用程序及相关文件 /var—系统专用数据和配置文件， 存放系统中经常变化的文件 /dev—终端和磁盘等设备的各种设备文件 /etc—存放系统中的配置文件 /bin—存放系统提供的一些未禁止可执行文件 /sbin—存放标准系统管理文件，通常是可执行二进制文件 /mnt—挂载点，所有外接设备都挂载在此目录下 标准linux运行级别位3或5 守护进程 在系统引导时自动启动，系统关闭时才终止。 dhcpd—动态主机控制协议（dhcp）服务守护进程 crond—unix传统程序，周期性运行用户调度的任务 httpd—web服务器apache守护进程 iptables—iptables防火墙守护进程 named—dns服务器守护进程 pppoe—adsl连接守护进程 sendmail—邮件服务器sendmail守护进出 smb—samba文件共享/打印服务守护进程 snmpd—简单网络管理守护进程 squid—代理服务器squid守护进程 sshd—ssh服务器守护进程 常见配置文件 1、ifcfg-ethx—系统eth接口IP配置信息，位于etc/sysconfgi/network/ifcfg-ethx,x代表不同网卡接口 2、/etc/sysconfig/network配置文件—系统基本网络信息 3、/etc/host.conf 配置文件—系统解析主机名或域名的解析顺序 4、/etc/hosts配置文件—系统中IP位置与主机对应关系的一个表 5、/etc/resolv.conf配置文件—存放DNS客户端设置文件 Linux 命令 1、ls 相当于dos dir 查看文件和目录信息 -a 显示隐藏的文件 -l 使用长格式显示文件内容 -F 在文件后面添加表示文件类型的符号，*表示可执行，/表示目录，@表示连接文件 第一列表示文件属性，r可读，w可写，x可执行。第一位表示文件类型，d代表目录，l代表连接文件，-代表普通文件，b代表块设备文件，c代表字符设备文件。剩余三个一组，owner-group-other 第二列表示文件个数 第三列拥有者 第四列表示所属组 第五列表示文件大小，byte为单位 第六列表示创建日期 第七列表示文件名 2、| 管道命令 “|” 将两个命令分开，左边命令的输出作为右边命令的输入 3、chmod 精确控制文档的存取权限 chmod mode file u表示文档拥有者，g表示与文档拥有者同组者，o表示其他人，a表示所有用户。 “+”表示增加权限，”-“表示取消权限，”=”表示直接设定权限 “r”代表可读，”w”表示可写，”x”表示可执行 r=4，w=2，x=1 rwx=7 4、cd 改变当前目录 5、mkdir rmdir 创建目录，删除目录 6、cp cp -r 源文件 目标文件 -r 连同子目录一起复制 7、rm 删除文件 -r 连同子目录一同删除，-f 强制删除，-i 加上提示信息，确认才能删除 8、mv 移动文件或者目录，也可用于重命名 -f 强制移动 9、pwd 显示当前工作目录 10、grep 查找当前文件夹下所有内容，列出包含string中指定的字符串并显示行号 -a 将binary以text文件方式搜索 -c 计算找到string的次数 -I 忽略大小写 11、mount mount -t type dev dir 将分区挂载在linux空文件夹下， 12、rpm 查询rpm包情况， rpm -q 实现参数查询 13、ps 查看进程 -aux 查看所有静态进程 -top 查看动态变化的进程 -A 查看所有进程 -r 只显示正在运行的进程 -l 用长格式显示 进程状态 D uninterruptible sleep R 运行中 S 休眠状态 T 停止或被追踪 W 内存交换 Z 僵死进程 14、kill kill signal pid 9表示无条件终止 15、passwd passwd option accountname -l 锁定，禁用账号 -u 口令解锁 -d 使账号无口令 -f 强迫用户下次登陆时修改口令 如果默认用户名，则修改当前用户口令 16、useradd 创建一个新用户账号 useradd option username -c comment 指定一段描述 -d 指定用户主目录 -g 指定用户所属用户组 -G 指定用户所属附加组 -s shell文件 指定用户登陆shell -u 用户名 username 指定新账号的登陆名 17、groupadd 创建组 groupadd option groupname -g 指定组id -r 建立系统组号 -f 创建一个已经存在的组账号时，强制结束groupadd -o gid不使用唯一值 网络配置命令1、ifconfig 查看，配置，启用，禁用网络接口工具 2、ifdown ifup 对本地连接进行启用和禁用 3、route -add 增加一条路由 -delete 删除路由 -net 表明路由到达的是一个网络，而不是主机 -host 表明路由到达的是一台主机 -netmask 指定目标网络子网掩码 -gw 指定路由使用的网关 dev If 指定路由使用的接口 4、traceroute 显示数据包从源主机到目的主机的中间路径 -d 使用顶级socket排错功能 -f 设置第一个数据包的存活数值TTL大小 -g 设置来源路由网关，最多8个 -I ifname 使用指定网络接口发送数据包 -I 使用icmp回应取代udp -m 设置数据包最大存活数的TTL大小 -n 直接使用ip地址 -p 设置udp传输的端口 -r 直接将数据包发送到远端主机 -s 设置本机送出的数据包的ip -t 设置检测数据包的tos数值 -v 显示指令的执行过程 -w 设置等待远端主句的回报时间 -x 开启或关闭数据包正确性校验 5、iptables ip包过滤 iptables [-t] command [match] [-j target/jump] command 常用命令： -a 新增规则到某个规则链中 -d 删除某条规则 -r 替代某个规则，不会改变顺序 -i 插入一条规则 -l 列出所有规则 -f 删除filter表中input链的所有规则 match常用参数： -p 匹配通信协议类型是否相符 -s 匹配数据包来源ip地址 -d 指定数据包目的ip地址 -i 指定数据包来源网卡 -o 指定数据包网卡出口 -sport 匹配数据包来源端口 -dport 匹配数据包目的端口 -j target/jump常用处理动作 -j 指定处理动作 accept 将数据包放行 reject 阻拦数据包并通知对方 drop 丢弃出具本不予处理 redirect 将数据包导向另一个端口 masquerade 改写数据包源地址为自身接口ip地址，可指定port对应范围 log 记录数据包相关信息到/var/log中 snat 改写数据包源ip为某特定ip或ip范围，可指定port范围 dnat 改写数据包目的ip为特定ip或ip范围，可指定port范围 iptables 主要用于IP地址伪装和数据包过滤 | 完结了，真不容易，期间多次被其他事情吸引注意力，最后还是回来了，也算是弯弯绕绕，最终到达终点。 | 接下来是漏洞挖掘方面的书籍，或者某个编程语言，或者数据结构，或者算法方面。","categories":[],"tags":[]},{"title":"hexo 美化之——添加背景音乐","slug":"hexo-美化之——添加背景音乐","date":"2019-11-22T12:25:24.000Z","updated":"2019-11-23T03:42:25.411Z","comments":true,"path":"2019/11/22/hexo-美化之——添加背景音乐/","link":"","permalink":"http://wxyadmin.github.io/2019/11/22/hexo-%E7%BE%8E%E5%8C%96%E4%B9%8B%E2%80%94%E2%80%94%E6%B7%BB%E5%8A%A0%E8%83%8C%E6%99%AF%E9%9F%B3%E4%B9%90/","excerpt":"生成网易云音乐外链播放器 登录网页版网易云音乐，打开一首歌，点击 ”生成外链播放器 生产外链播放器代码，把代码粘贴到你想放的位置。 侧栏添加背景音乐","text":"生成网易云音乐外链播放器 登录网页版网易云音乐，打开一首歌，点击 ”生成外链播放器 生产外链播放器代码，把代码粘贴到你想放的位置。 侧栏添加背景音乐 引入播放器代码在themes/yilia/layout/_partial/left-col.ejs文件nav标签中添加代码注：放在和之内放到div里就行 在yilia主题配置文件中添加属性12345# 网易云音乐插件music: enable: true #id: 1332647902 # 网易云分享的ID autoplay: true # 是否开启自动播放 在文章中添加音乐配置hexo下的_config.yml的1post_asset_folder: true 设置为true。 把音乐插件代码直接添加到文章中你想添加的位置就ok了。","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://wxyadmin.github.io/tags/hexo/"}]},{"title":"采用韩国插件来必力实现评论功能","slug":"采用韩国插件来必力实现评论功能","date":"2019-11-22T10:24:16.000Z","updated":"2019-11-22T11:04:51.055Z","comments":true,"path":"2019/11/22/采用韩国插件来必力实现评论功能/","link":"","permalink":"http://wxyadmin.github.io/2019/11/22/%E9%87%87%E7%94%A8%E9%9F%A9%E5%9B%BD%E6%8F%92%E4%BB%B6%E6%9D%A5%E5%BF%85%E5%8A%9B%E5%AE%9E%E7%8E%B0%E8%AF%84%E8%AE%BA%E5%8A%9F%E8%83%BD/","excerpt":"传送门注册账号，虽说livere是韩国的插件，但也支持qq邮箱登录注册，相当方便 点击右上角，登录，填写所需信息 点击页面顶部的安装即可获取网页代码 获取到了代码全部复制下来,因为等一下会用到","text":"传送门注册账号，虽说livere是韩国的插件，但也支持qq邮箱登录注册，相当方便 点击右上角，登录，填写所需信息 点击页面顶部的安装即可获取网页代码 获取到了代码全部复制下来,因为等一下会用到 配置本地站点 主题路径bolg-themes-yilia-layout-_partial-post 新建一个.ejs文件 在编辑器中打开，把复制的代码粘贴在里面就行了 12345678910111213修改hexo\\themes\\yilia\\layout\\_partial\\article.ejs,找到&lt;% if (!index &amp;&amp; post.comments)&#123; %&gt;2在此下方添加下列代码： &lt;% if (theme.livere)&#123; %&gt; &lt;%- partial(&apos;post/livere&apos;, &#123; key: post.slug, title: post.title, url: config.url+url_for(post.path) &#125;) %&gt; &lt;% &#125; %&gt; 打开你主题的设置项：_config.yml（注意不是hexo的_config.yml，而是yilia的文件夹里的_config.yml）把id复制下来，随便找个地方放进去data-uid=”复制的这个之间id==”&gt;来必力livere: 此处为N个省略号 最后部署到服务器即可","categories":[],"tags":[{"name":"hexo插件","slug":"hexo插件","permalink":"http://wxyadmin.github.io/tags/hexo%E6%8F%92%E4%BB%B6/"}]},{"title":"Markdown简单用法","slug":"Markdown简单用法","date":"2019-11-21T07:24:16.000Z","updated":"2019-11-22T10:56:55.112Z","comments":true,"path":"2019/11/21/Markdown简单用法/","link":"","permalink":"http://wxyadmin.github.io/2019/11/21/Markdown%E7%AE%80%E5%8D%95%E7%94%A8%E6%B3%95/","excerpt":"###本文主要叙述如何写出更加优美的markdown文档。 标题123456# 标题一级## 标题二级### 标题三级#### 标题四级##### 标题五级###### 标题六级","text":"###本文主要叙述如何写出更加优美的markdown文档。 标题123456# 标题一级## 标题二级### 标题三级#### 标题四级##### 标题五级###### 标题六级 标题一级标题二级标题三级标题四级标题五级标题六级 字体样式 12345**加粗字体***斜体字体****斜体与加粗***_这也能显示斜体_~~此段内容删除~~ 加粗字体斜体字体斜体与加粗这也能显示斜体此段内容删除 引用文字1&gt; 这里添加引用文字 这里添加引用文字 123&gt; 带有多个段落的块引用&gt;&gt; 带有多个段落的块引用 带有多个段落的块引用 带有多个段落的块引用 123&gt; 嵌套引用1.&gt;&gt;&gt; 嵌套引用2. 嵌套引用1. 嵌套引用2. 123456&gt; #### 标题四级&gt;&gt; - 段落一&gt; - 段落二.&gt;&gt; *斜体* 与 **加粗**. 标题四级 段落一 段落二. 斜体 与 加粗. 清单列表格式123456781. 条目一98. 条目二97. 条目三96. 条目四 1. 缩进一 前面4个空格 2. 缩进二 前面4个空格 9. 缩进三 或双Tab100. 条目五 条目一 条目二 条目三 条目四 缩进一 前面4个空格 缩进二 前面4个空格 缩进三 或双Tab 条目五 12345678* 条目一- 条目二+ 条目三- 条目四 * 缩进一 前面4个空格 * 缩进二 前面4个空格 * 缩进三 或双Tab+ 条目五 条目一 条目二 条目三 条目四 缩进一 前面4个空格 缩进二 前面4个空格 缩进三 或双Tab 条目五 单行短句或代码块123`单行短句```我也是单行短句`````[回车]我是代码块[回车] 12我是代码块` 水平线 123`单行短句```我也是单行短句`````[回车]我是代码块[回车] 12我是代码块` 水平线 链接 123[我的主页-无备注](https://www.jianshu.com/u/b073bda81e95)[我的主页-有备注](https://www.jianshu.com/u/b073bda81e95 &quot;我的主页备注信息&quot;)` 我的主页-无备注我的主页-有备注 表格 1234| 标题|内容|备注|| ------ | :------:|------:||标题1 |内容1|备注1|| 标题2 | 内容2|备注2| 标题 内容 备注 标题1 内容1 备注1 标题2 内容2 备注2 -: 设置内容和标题栏居右对齐 :- 设置内容和标题栏居左对齐 :-: 设置内容和标题栏居中对齐 插入图片 Markdown插图片有三种方法各种Markdown编辑器的插图方式也都包含在这三种方法之内 插入本地图片插入网络图片把图片存入markdown文件 图片转化为base64字符串 base64字符串转化为图片 插入图片的基础格式 1![Alt text](图片链接 &quot;optional title&quot;) [图片上传失败…(image-7c2954-1574314679412)] Alt text：图片的Alt标签，用来描述图片的关键词，可以不写。最初的本意是当图片因为某种原因不能被显示时而出现的替代文字，后来又被用于SEO，可以方便搜索引擎根据Alt text里面的关键词搜索到图片。 图片链接：可以是图片的本地地址或者是网址。”optional title”：鼠标悬置于图片上会出现的标题文字，可以不写。 1![1.jpg](https://upload-images.jianshu.io/upload_images/17269571-0c7500da491e19db.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240) 在Markdown中写注释hack方法hack方法就是利用markdown的解析原理来实现注释的。 一般有的markdown解析器不支持上面的注释方法，这个时候就可以用hack方法。 hack方法比上面2种方法稳定得多，但是语义化太差。 1234567891011[comment]: &lt;&gt; (哈哈我是注释，不会在浏览器中显示。)[comment]: &lt;&gt; (哈哈我是注释，不会在浏览器中显示。)[comment]: &lt;&gt; (哈哈我是注释，不会在浏览器中显示。)[//]: &lt;&gt; (哈哈我是注释，不会在浏览器中显示。)[//]: # (哈哈我是注释，不会在浏览器中显示。)其中，这种方法最稳定，适用性最强：[//]: # (哈哈我是注释，不会在浏览器中显示。)这种方法最可爱，超级无敌萌啊：[^_^]: # (哈哈我是注释，不会在浏览器中显示。) 既然Markdown内嵌html语法，那么就可以用可以用隐藏的html标签。注意：需要在前面空一行1.markdowm首行缩进方法 一个汉字占两个空格大小，所以使用四个空格就可以达到首行缩进两个汉字的效果。有如下几种方法： 一个空格大小的表示：&ensp;或&#8194;，此时只要在相应需要缩进的段落前加上 4个 如上的标记即可，注意要带上分号。 两个空格的大小表示：&emsp;或&#8195;，同理，使用2个即可缩进2个汉字，推荐使用该方式。 不换行空格：&nbsp;或&#160;，使用4个&#160;即可。换行 1&lt;br&gt; 上标：2 1&lt;sup&gt;2&lt;/sup&gt;下表:2 1&lt;sub&gt;2&lt;/sub&gt; 以上空格实体的详细介绍如下： 2.HTML中的实体空格 HTML提供了5种空格实体（space entity），它们拥有不同的宽度，非断行空格（&nbsp;）是常规空格的宽度，可运行于所有主流浏览器。其他几种空格（&ensp; &emsp; &thinsp; &zwnj; &zwj;）在不同浏览器中宽度各异。 &nbsp; 它叫不换行空格，全称是 No-Break Space，它是最常见和我们使用最多的空格，大多数的人可能只接触了&nbsp;，它是按下space键产生的空格。在HTML中，如果你用空格键产生此空格，空格是不会累加的（只算1个）。要使用html实体表示才可累加，该空格占据宽度受字体影响明显而强烈。 &ensp; 它叫“半角空格”，全称是 En Space，en是字体排印学的计量单位，为em宽度的一半。根据定义，它等同于字体度的一半（如16px字体中就是8px）。名义上是小写字母n的宽度。此空格传承空格家族一贯的特性：透明的，此空格有个相当稳健的特性，就是其占据的宽度正好是1/2个中文宽度，而且基本上不受字体影响。 &emsp; 它叫“全角空格”，全称是 Em Space，em是字体排印学的计量单位，相当于当前指定的点数。例如，1 em在16px的字体中就是16px。此空格也传承空格家族一贯的特性：透明的，此空格也有个相当稳健的特性，就是其占据的宽度正好是1个中文宽度，而且基本上不受字体影响。 &thinsp; 它叫“窄空格”，全称是 Thin Space。我们不妨称之为“瘦弱空格”，就是该空格长得比较瘦弱，身体单薄，占据的宽度比较小。它是em之六分之一宽。 &zwnj; 它叫零宽不连字，全称是 Zero Width Non Joiner，简称“ZWNJ”，是一个不打印字符，放在电子文本的两个字符之间，抑制本来会发生的连字，而是以这两个字符原本的字形来绘制。Unicode中的零宽不连字字符映射为“”（zero width non-joiner，U+200C），HTML字符值引用为： “‌” &zwj; 它叫零宽连字，全称是 Zero Width Joiner，简称“ZWJ”，是一个不打印字符，放在某些需要复杂排版语言（如阿拉伯语、印地语）的两个字符之间，使得这两个本不会发生连字的字符产生了连字效果。零宽连字符的Unicode码位是U+200D (HTML: ‍ ‍）。此外，浏览器还会把以下字符当作空白进行解析：空格（ ）、制表位（ ）、换行（ ）和回车（ ）还有（ ）等等。 这一行需要居中 我是黑体字 颜色 注意：配置文件编码格式改成UTF8.不然中文乱码","categories":[],"tags":[{"name":"Markdown使用","slug":"Markdown使用","permalink":"http://wxyadmin.github.io/tags/Markdown%E4%BD%BF%E7%94%A8/"}]},{"title":"Hexo学习","slug":"Hexo学习","date":"2019-11-02T04:24:16.000Z","updated":"2019-11-22T10:56:28.483Z","comments":true,"path":"2019/11/02/Hexo学习/","link":"","permalink":"http://wxyadmin.github.io/2019/11/02/Hexo%E5%AD%A6%E4%B9%A0/","excerpt":"白茶清欢无别事，我在等风也等你纸上得来终觉浅，觉知此事要躬行自有搭建个人博客的想法的那一刻开始到现在应该也快一个星期了，我就把我这一星期搭建hexo博客的过程复现一遍 以下演示基于windows 10系统，所有以下在windows10 64位下进行演示。","text":"白茶清欢无别事，我在等风也等你纸上得来终觉浅，觉知此事要躬行自有搭建个人博客的想法的那一刻开始到现在应该也快一个星期了，我就把我这一星期搭建hexo博客的过程复现一遍 以下演示基于windows 10系统，所有以下在windows10 64位下进行演示。 安装 Node.js 因为 hexo 是基于 node 框架的，所以呢，我们首先需要下载安装node.js。下载地址 安装步骤一直自定义下一步，如需更改安装路径将C改成D即可，最后点击Finish。 安装Git 下载地址 选择适合自己系统的安装即可，同样，默认一直选择下一步安装即可。安装成功在开始菜单这个Git Bash下载下来就相当于Linux中的终端窗口了，以后我们就用这个东东来打开终端。 安装hexo 新建一个文件夹，例如我建的blog 打开文件夹，然后在空白处点鼠标的右键，Git Bash Here 建好后进去右键 git bash here 输入 node -v 看会不会显示出版本号,接着输入npm -v同理看有无版本号 接下来安装cnpm，在上面的终端中输入12345npm install -g cnpm -registry=https://registry.npm.taobao.org/``` 这里选择镜像到淘宝因为npm在国内的下载速度堪忧，一般情况可以安装成功，不成功就在执行一次命令- 接着就可以安装*hexo*了 输入 cnpm install -g hexo-cli1234安装后也可以用**hexo -v**检查是否成功。4. 搭建*hexo*框架我们刚刚建的博客文件夹不管是之后进阶美化还是发博客都在这个文件夹中进行操作,与此同时如果你在之后操作过程中瞎折腾回不去了就直接删掉文件夹中内容重新 hexo init回档好了在当前目录下执行 hexo init12完后正常情况最后会有一行**INFO Start blogging with Hexo!**再输入一行 hexo s12345678910你的本地环境就搭建好了，可以用Ctrl+C停止浏览器里输入**localhost: 4000**就能本地查看你的博客了5. 然后就可以部署到远端了注册一个github账号仓库命名开头一定要是你自己的昵称.这个仓库就是存你hexo数据的地方然后我们输入命令``` npm install hexo-deployer-git -save或cnpm install -save hexo-deployer-git 这个插件相当于是沟通你本地数据与github仓库的通道,之后在每次本地数据编辑完后都要用到它首先查看目录C:Users\\用户名有没有.ssh目录,如果没有，在本地blog文件内打开git bash hexo,输入命令:1ssh-keygen -t rsa -C &quot;邮箱地址&quot; 然后按3个回车，再检查有没有.ssh目录打开id_rsa.pub这个文件，进入你刚才创建的仓库，设置-部署公钥-新建部署公钥，公钥名称可以不填，将刚才复制的公钥粘贴在公钥内容里面 修改站点配置文件 deploy 参数内容到文件夹根目录下找config.yml的配置文件进去type后加git 并添加repo: https://github.com/youname/yourname.git/ ; branch: master repo后面的网址就是新建仓库的网址接下来就是搭建的最后一步 : bit bash 中输入hexo d 进行最终的部署工作, 这时它会让你填你的username和password 作为进入仓库的凭证12git config --global useer.email &quot;you@example.com&quot;git config --global useer.name &quot;Your Name&quot; 注意一下，这一步输错的话呢，就的重头再来了还要注意的呢就是冒号后面要有空格win7和win10有点区别，未完待续。。。。。","categories":[],"tags":[{"name":"hexo搭建","slug":"hexo搭建","permalink":"http://wxyadmin.github.io/tags/hexo%E6%90%AD%E5%BB%BA/"}]}]}